<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITADSCH_STD
$ary[101020] = "緊急停止しました。ステータスをご確認下さい。(作業No.:{})";
$ary[102090] = "予約を取り消しました。ステータスをご確認下さい。(作業No.:{})";
$ary[50001] = "確認対象レコード無し";
$ary[50002] = "確認対象レコード検出(EXECUTION_NO:{})";
$ary[50003] = "確認対象レコードの処理ループ開始";
$ary[50004] = "[処理]トランザクション開始(作業No.:{})";
$ary[50008] = "[処理]レコードロック(作業No.:{})";
$ary[50009] = "[処理]REST APIコール開始(作業No.:{})";
$ary[50016] = "[処理]resultdata取り出し(作業No.:{})";
$ary[50025] = "[処理]ステータスを「想定外エラー」とします(作業No.:{})";
$ary[50028] = "[処理]ステータスを「完了」とします(作業No.:{})";
$ary[50029] = "[処理]完了orエラー向けのUPDATE文を生成(作業No.:{})";
$ary[50030] = "[処理]遅延を検出(作業No.:{})";
$ary[50031] = "[処理]遅延無し(作業No.:{})";
$ary[50034] = "[処理]ステータスを「実行中(遅延)」とします(作業No.:{})";
$ary[50036] = "[処理]実行中 or 実行中(遅延)向けのUPDATE文を生成(作業No.:{})";
$ary[50037] = "[処理]UPDATE実行(作業No.:{})";
$ary[50039] = "[処理]コミット(作業No.:{})";
$ary[50040] = "[処理]トランザクション終了(作業No.:{})";
$ary[50041] = "確認対象レコードの処理ループ終了(作業No.:{})";
$ary[50042] = "ロールバック(作業No.:{})";
$ary[50043] = "ロールバック";
$ary[50046] = "[作業No.({})]トランザクション終了";
$ary[50047] = "トランザクション終了";
$ary[50051] = "[処理]履歴ファイル作成(作業No.:{} ファイル名:{})";
$ary[51001] = "トランザクション開始(ステータスを「準備中」に変更する処理)";
$ary[51002] = "トランザクション終了(ステータスを「準備中」に変更する処理)";
$ary[51003] = "処理対象レコード無し";
$ary[51004] = "処理対象レコード検出(EXECUTION_NO:{})";
$ary[51005] = "ステータス「準備中」へのUPDATEループ開始";
$ary[51006] = "[処理]UPDATE実行(ステータス＝「準備中」)(作業No.:{})";
$ary[51007] = "ステータス「準備中」へのUPDATEループ終了";
$ary[51008] = "コミット(ステータスを「準備中」に変更する処理)";
$ary[51009] = "トランザクション終了(ステータスを「準備中」に変更する処理)";
$ary[51010] = "処理対象レコードの処理ループ開始";
$ary[51011] = "[処理]トランザクション開始(作業No.:{})";
$ary[51015] = "[処理]レコードロック(作業No.:{})";
$ary[51066] = "[処理]REST APIコール開始(作業No.:{})";
$ary[51067] = "[処理]REST APIコール終了(作業No.:{} HTTPレスポンスコード:{})";
$ary[51071] = "[処理](作業No.:{} REST APIエラーフラグ:{})";
$ary[51072] = "[処理]正常向けのUPDATE文を生成(作業No.:{})";
$ary[51074] = "[処理]異常向けのUPDATE文を生成(作業No.:{})";
$ary[51075] = "[処理]UPDATE実行(作業No.:{})";
$ary[51077] = "[処理]コミット(作業No.:{})";
$ary[51078] = "[処理]トランザクション終了(作業No.:{})";
$ary[51080] = "処理対象レコードの処理ループ終了";
$ary[51081] = "ロールバック(作業No.:{})";
$ary[51082] = "ロールバック";
$ary[51085] = "トランザクション終了(作業No.:{})";
$ary[51086] = "トランザクション終了";
$ary[55001] = "プロシージャ開始";
$ary[55002] = "プロシージャ終了(正常)";
$ary[55003] = "DBコネクト完了";
$ary[55004] = "[処理]トランザクション開始";
$ary[55005] = "[処理]トランザクション終了";
$ary[55015] = "[処理]コミット";
$ary[55016] = "[処理]ロールバック";
$ary[58101] = "[処理]入力ディレクトリを圧縮([作業No.]:{} 圧縮ファイル:{}) ";
$ary[59101] = "[処理]結果ディレクトリを圧縮([作業No.]:{} 圧縮ファイル:{}) ";
$ary[59801] = "[処理]履歴ファイル作成([作業No.]:{} ファイル名:{}) ";

$ary[70000] = "[処理]紐付対象メニュー情報の取得";
$ary[70001] = "[処理]紐付対象メニューテーブル管理 追加 (MENU_ID:{})";
$ary[70002] = "[処理]紐付対象メニューテーブル管理 復活 (MENU_ID:{})";
$ary[70003] = "[処理]紐付対象メニューテーブル管理 更新 (MENU_ID:{} TBALE:{})";
$ary[70004] = "[処理]紐付対象メニューテーブル管理 廃止 (MENU_ID:{})";
$ary[70005] = "[処理]紐付対象メニューのカラム情報の取得 (MENU_ID:{})";
$ary[70006] = "[処理]紐付対象メニューテーブル管理 未更新 (MENU_ID:{})";
$ary[70007] = "[処理]紐付対象メニューカラム管理 未更新 (MENU_ID:{} COLUMN:{})";
$ary[70008] = "[処理]紐付対象メニューカラム管理 追加 (MENU_ID:{} COLUMN:{})";
$ary[70009] = "[処理]紐付対象メニューカラム管理 復活 (MENU_ID:{} COLUMN:{})";
$ary[70010] = "[処理]紐付対象メニューカラム管理 更新 (MENU_ID:{} COLUMN:{})";
$ary[70011] = "[処理]紐付対象メニューカラム管理 廃止 (MENU_ID:{} COLUMN:{})";
$ary[70012] = "[処理]紐付対象メニューテーブル管理から不要メニュー削除";
$ary[70013] = "[処理]紐付対象メニューカラム管理から不要メニューカラム削除";
$ary[70014] = "[処理]代入値自動登録設定から不要メニューカラムを廃止";
$ary[70015] = "[処理]代入値自動登録設定からカラム毎の変数の情報を取得";
$ary[70016] = "[処理]紐付対象メニューから具体値を取得";
$ary[70017] = "[処理]紐付対象メニューから具体値を取得（MENU_ID:{}）";
$ary[70018] = "[処理]一般変数を紐付けている紐付対象メニューの具体値を代入値管理に登録";
$ary[70019] = "[処理]配列変数を紐付けている紐付対象メニューの具体値を代入値管理に登録";
$ary[70020] = "[処理]代入値管理から不要なデータを削除";
$ary[70021] = "[処理]作業対象ホストに登録されていないオペレーションID+MovementID+ホストIDが作業対象ホストを登録";
$ary[70022] = "[処理]作業対象ホストから不要なデータを削除";
$ary[70023] = "[処理]代入値管理 追加 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} ASSIGN_SEQ:{})";
$ary[70024] = "[処理]代入値管理 復活 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} ASSIGN_SEQ:{})";
$ary[70025] = "[処理]代入値管理 更新 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} ASSIGN_SEQ:{})";
$ary[70026] = "[処理]代入値管理 更新不要 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} ASSIGN_SEQ:{})";
$ary[70027] = "[処理]代入値管理 追加 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70028] = "[処理]代入値管理 復活 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70029] = "[処理]代入値管理 更新 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70030] = "[処理]代入値管理 更新不要 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70031] = "[処理]代入値管理 廃止 (ASSIGN_ID:{})";
$ary[70032] = "[処理]作業対象ホスト 追加 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{})";
$ary[70033] = "[処理]作業対象ホスト 復活 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{})";
$ary[70034] = "[処理]作業対象ホスト 廃止 (PHO_LINK_ID:{})";
$ary[70035] = "[処理]代入値自動登録設定を廃止（項番:{}）";
$ary[70036] = "[処理]代入値管理 最終更新者が自分でないので更新スキップ (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70037] = "[処理]代入値管理 最終更新者が自分でないので更新スキップ (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} CHILD_VARS_LINK_ID:{} CHILD_VARS_COL_SEQ:{})";
$ary[70038] = "[処理]代入値管理 最終更新者が自分でないので廃止スキップ (ASSIGN_ID:{})";
$ary[70039] = "[処理]作業対象ホスト 最終更新者が自分でないので廃止スキップ (PHO_LINK_ID:{})";
$ary[70040] = "[処理]変数名管理 最終更新者が自分でないので廃止スキップ \n{}";
$ary[70041] = "[処理]メンバー変数管理 最終更新者が自分でないので廃止スキップ\n {}";
$ary[70042] = "[処理]Movement変数紐付管理 最終更新者が自分でないので廃止スキップ\n {}";
$ary[70043] = "[処理]変数名管理 最終更新者が自分でないので更新スキップ \n{}";
$ary[70044] = "[処理]一般変数・複数具体値変数を紐付けている紐付対象メニューの具体値を代入値管理に登録";
$ary[70046] = "[処理]代入値管理 最終更新者が自分でないので更新スキップ (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} ASSIGN_SEQ:{})";
$ary[70047] = "[処理]代入値管理 追加 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} COL_SEQ_COMBINATION_ID:{})";
$ary[70048] = "[処理]代入値管理 復活 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} COL_SEQ_COMBINATION_ID:{} ASSIGN_SEQ:{})";
$ary[70049] = "[処理]代入値管理 更新 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} COL_SEQ_COMBINATION_ID:{} ASSIGN_SEQ:{})";
$ary[70050] = "[処理]代入値管理 更新不要 (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} COL_SEQ_COMBINATION_ID:{} ASSIGN_SEQ:{})";
$ary[70051] = "[処理]代入値管理 最終更新者が自分でないので更新スキップ (OPERATION_ID:{} PATTERN_ID:{} SYSTEM_ID:{} VARS_LINK_ID:{} COL_SEQ_COMBINATION_ID:{} ASSIGN_SEQ:{})";

$ary[990000] = "トランザクション終了";
$ary[990001] = "プロシージャ開始";
$ary[990002] = "プロシージャ終了(正常)";
$ary[990003] = "DBコネクト完了";
$ary[990004] = "[処理]トランザクション開始";
$ary[990005] = "[処理]トランザクション終了";
$ary[990006] = "[処理]コミット";
$ary[990007] = "[処理]ロールバック";
$ary[990008] = "代入値管理から保管期限切れのレコード廃止(テーブル:{})";
$ary[990009] = "対象ホスト管理から保管期限切れのレコード廃止(テーブル:{})";
$ary[990010] = "代入値管理から保管期限切れのレコード物理削除(テーブル:{})";
$ary[990011] = "対象ホスト管理から保管期限切れのレコード物理削除(テーブル:{})";
$ary[990012] = "代入値管理からオペレーションID紐付切れのレコード物理削除(テーブル:{})";
$ary[990013] = "対象ホスト管理からオペレーションID紐付切れのレコード物理削除(テーブル:{})";
$ary[990014] = "RESTAPI 処理開始";
$ary[990015] = "実行処理";
$ary[990016] = "確認処理";
$ary[990017] = "[処理]REST API 実行処理開始(作業No.{})";
$ary[990018] = "{} Start outputting error messages";
$ary[990019] = "[DSC コンパイル処理] 処理開始(作業No.{} コンフィグファイル:{})";
$ary[990020] = "[DSC コンパイル処理] 処理完了(作業No.{} コンフィグファイル:{})";
$ary[990021] = "[DSC 構成適用処理] 処理開始(作業No.{} コンフィグファイル:{})";
$ary[990022] = "[DSC 構成適用処理] 処理完了(作業No.{} コンフィグファイル:{})";
$ary[990023] = "[DSC 確認処理] 処理開始(作業No.{} コンフィグファイル:{})";
$ary[990024] = "[DSC 確認処理] 処理完了(作業No.{} コンフィグファイル:{})";
$ary[990025] = "[DSC 確認処理] 作業対象ノードは構成適用前か構成適用完了状態です。(作業No.{} 作業対象ノード:{} 状態:{} 処理結果:{})";
$ary[990026] = "[DSC 確認処理] 作業対象ノードは構成適用処理中です。(作業No.{} 作業対象ノード:{} 状態:{} 処理結果:{})";
$ary[990027] = "[DSC 確認処理] 作業対象ノードは再起動要求中(PendingReboot)です。(作業No.{} 作業対象ノード:{} 状態:{} 処理結果:{})";
$ary[990028] = "[DSC テスト処理] 処理開始(作業No.{} コンフィグファイル:{})";
$ary[990029] = "[DSC テスト処理] 処理完了(作業No.{} コンフィグファイル:{})";
$ary[990030] = "[DSC テスト処理] LCMの構成情報と作業対象ノードの構成は一致していました。(作業No.{} 作業対象ノード:{})";
$ary[990031] = "RESTAPI 緊急停止処理開始";
$ary[990032] = "[DSC 緊急停止処理] 処理開始(作業No.{} )";
$ary[990033] = "[DSC 緊急停止処理] 停止作業対象ノード(作業No.{} 作業対象ノード {})";
$ary[990034] = "[DSC 緊急停止処理] 停止処理前検知:対象ノードに稼働中のDSCプロセスがありました。プロセス停止を試みます。(作業No.{} 作業対象ノード{} 作業対象ノードのステータス{})";
$ary[990035] = "[DSC 緊急停止処理] プロセス停止処理成功 (作業No.{} 作業対象ノード{} 結果{} 作業対象ノードのステータス{})";
$ary[990036] = "[DSC 緊急停止処理] 停止処理後検知:プロセス停止確認成功 (作業No.{} 作業対象ノード{} 結果{} 作業対象ノードのステータス{})";
$ary[990037] = "[DSC 緊急停止処理] 緊急停止ファイル(forced.txt)が、既に存在していたので削除しました。(作業No.{} 作業対象ノード{} 結果{} 作業対象ノードのステータス{})";
$ary[990038] = "[DSC 緊急停止処理] 緊急停止ファイル(forced.txt)が出力されました(作業No.{} )";
$ary[990039] = "[DSC 緊急停止処理] 緊急停止ファイル(forced.txt)が出力されました(作業No.{} )";
$ary[990040] = "[DSC LCM設定処理] 処理開始(作業No.{} コンフィグファイル:{} 作業対象ノード:{})";
$ary[990041] = "[DSC LCM設定処理] 処理完了(作業No.{} コンフィグファイル:{} 作業対象ノード:{})";
?>