<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITACREPAR_MNU
$ary[102001] = "作成するパラメータシートのメニュー名をメンテナンス(参照/更新/廃止/復活)できます。<br>
「メインメニュー」というメニュー名は使用できません。";
$ary[102002] = "項番";
$ary[102003] = "パラメータシート作成情報";
$ary[102004] = "パラメータシート作成情報";
$ary[102005] = "メニュー名";
$ary[102006] = "作成するメニュー名を入力します。";
$ary[102007] = "表示順序";
$ary[102008] = "メニューグループに表示順序を入力します。昇順に表示されます。";
$ary[102009] = "用途";
$ary[102010] = "作成するメニューの用途を入力します。";
$ary[102011] = "ホストグループ用メニューグループ";
$ary[102012] = "ホストグループ用メニューの作成先メニューグループを入力します。";
$ary[102013] = "ホスト用メニューグループ";
$ary[102014] = "ホスト用メニューの作成先メニューグループを入力します。";
$ary[102015] = "参照用メニューグループ";
$ary[102016] = "参照用メニューの作成先メニューグループを入力します。";
$ary[102017] = "説明";
$ary[102018] = "メニュー画面の説明欄に表示する内容を入力します。";
$ary[102019] = "項目作成情報";
$ary[102020] = "項目作成情報";
$ary[102021] = "縦メニュー用メニューグループ";
$ary[102022] = "縦メニューの作成先メニューグループを入力します。";
$ary[102101] = "パラメータシートで管理する項目をメンテナンス(参照/更新/廃止/復活)できます。";
$ary[102102] = "項番";
$ary[102103] = "パラメータシート項目作成情報";
$ary[102104] = "パラメータシート項目作成情報";
$ary[102105] = "メニュー名";
$ary[102106] = "パラメータを紐付けするメニューをプルダウンから選択します。";
$ary[102107] = "項目名";
$ary[102108] = "メニューに表示する項目名を入力します。";
$ary[102109] = "最大バイト数";
$ary[102110] = "最大バイト数を入力します。
半角英数字なら文字数分となります。
全角文字ならば文字数×３＋２バイト必要になります。
一つのメニューに紐付けできる合計のバイト数(53460Byte)を超過すると、エラーになります。";
$ary[102111] = "表示順序";
$ary[102112] = "メニューに表示されるカラムの順序を入力します。左から昇順に表示されます。";
$ary[102113] = "必須";
$ary[102114] = "必須項目の場合は「●」を設定します。";
$ary[102115] = "正規表現";
$ary[102116] = "正規表現で入力制限を行いたい場合に設定します。\n例：\n半角数字のみ（値なしも許容）：/^[0-9]*$/\n半角英数字のみ（値必須）：/^[a-zA-Z0-9]+$/";
$ary[102117] = "説明";
$ary[102118] = "項目名をマウスオーバーした際に表示される説明を入力します。";
$ary[102119] = "一意制約";
$ary[102120] = "一意制約をつける場合は「●」を設定します。";
$ary[102121] = "入力方式";
$ary[102122] = "「文字列」か「他メニュー参照」を選択します。";
$ary[102123] = "メニューグループ：メニュー：項目";
$ary[102124] = "参照する項目を選択します。";
$ary[102125] = "文字列";
$ary[102126] = "他メニュー参照";
$ary[102127] = "カラムグループ";
$ary[102128] = "所属するカラムグループを選択します。";
$ary[102201] = "作成したメニューとDBのテーブルの紐付けを表示します。";
$ary[102202] = "項番";
$ary[102203] = "パラメータシート・テーブル紐付";
$ary[102204] = "パラメータシート・テーブル紐付";
$ary[102205] = "メニューグループ：メニュー";
$ary[102206] = "作成したメニュー名です。";
$ary[102207] = "テーブル名";
$ary[102208] = "作成したテーブル名です。";
$ary[102209] = "主キー";
$ary[102210] = "作成したテーブルの主キーです。";
$ary[102211] = "テーブル名(履歴)";
$ary[102212] = "作成した履歴テーブル名です。";
$ary[102401] = "パラメータシート作成の状態を参照できます。";
$ary[102402] = "項番";
$ary[102403] = "パラメータシート作成管理";
$ary[102404] = "パラメータシート作成管理";
$ary[102405] = "メニュー名";
$ary[102406] = "作成対象のメニュー名です。";
$ary[102407] = "ステータス";
$ary[102408] = "メニュー作成状況のステータスです。
未実行：メニュー作成前の状態
実行中：BackYardがメニュー作成処理を実行中
完了　：メニュー作成がが正常に完了
完了（異常）：メニュー作成時にエラー終了した状態";
$ary[102409] = "メニュー資材";
$ary[102410] = "メニューにて使用されるPHPファイルとSQLファイルです。";
$ary[102411] = "作成したメニュー";
$ary[102412] = "作成したメニュー";
$ary[102501] = "「パラメータシート作成情報」で指定したメニューグループにパラメータシートのメニューを作成します。<br/>※既に同じメニュー名のメニューや「パラメータシート作成情報」の項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。<br>入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary[102502] = "パラメータシート作成";
$ary[102503] = "パラメータシート作成開始";
$ary[102504] = "作成対象がありません。";
$ary[102505] = "全てをチェック";
$ary[102506] = "パラメータシート作成を受付ました。";
$ary[102507] = "項番";
$ary[102508] = "パラメータシート作成管理";
$ary[102509] = "作成するパラメータシートを選択してください。";
$ary[102510] = "パラメータシート作成を実行しますか？\\n\\n※既に同じメニュー名のメニューや「パラメータシート作成情報」の項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。\\n入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary[102601] = "ホスト名";
$ary[102602] = "ホストグループ名";
$ary[102603] = "オペレーション";
$ary[102604] = "実施予定日時";
$ary[102605] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[102606] = "ID";
$ary[102607] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[102608] = "オペレーション名";
$ary[102609] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[102610] = "オペレーション";
$ary[102611] = "基本コンソール/投入オペレーション一覧の「実施予定日時」、「オペレーションID」、「オペレーション名」を結合した値";
$ary[102612] = "パラメータ";
$ary[102613] = "代入順序";
$ary[102614] = "パラメータシートの縦メニューから横メニューに変換する際に、左から昇順で入力されます。";
$ary[102615] = "基準日時";
$ary[102616] = "基本コンソール/投入オペレーション一覧の「最終実行日時」に値がある場合は「最終実行日時」、値が無い場合は「実施予定日時」";
$ary[102617] = "最終実行日時";
$ary[102618] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[102701] = "「パラメータシート項目作成情報」メニューの「他メニュー参照」で選択する項目を作成するためのメニュー<br/>自動で作成される。";
$ary[102702] = "項番";
$ary[102703] = "他メニュー連携";
$ary[102704] = "他メニュー連携";
$ary[102705] = "メニューグループ";
$ary[102706] = "";
$ary[102707] = "メニュー";
$ary[102708] = "";
$ary[102709] = "項目名";
$ary[102710] = "";
$ary[102711] = "メニューグループ：メニュー：項目名";
$ary[102712] = "";
$ary[102713] = "テーブル名";
$ary[102714] = "";
$ary[102715] = "主キー";
$ary[102716] = "";
$ary[102717] = "カラム名";
$ary[102718] = "";
$ary[102719] = "メニューグループ：メニュー";
$ary[102720] = "";
$ary[103001] = "作成するマスタのメニュー名をメンテナンス(参照/更新/廃止/復活)できます。<br>
「メインメニュー」というメニュー名は使用できません。";
$ary[103002] = "項番";
$ary[103003] = "マスタ作成情報";
$ary[103004] = "マスタ作成情報";
$ary[103005] = "メニュー名";
$ary[103006] = "作成するメニュー名を入力します。";
$ary[103007] = "表示順序";
$ary[103008] = "メニューグループに表示順序を入力します。昇順に表示されます。";
$ary[103009] = "メニューグループ";
$ary[103010] = "作成先メニューグループを入力します。";
$ary[103011] = "説明";
$ary[103012] = "メニュー画面の説明欄に表示する内容を入力します。";
$ary[103013] = "項目作成情報";
$ary[103014] = "項目作成情報";
$ary[103101] = "マスタで管理する項目をメンテナンス(参照/更新/廃止/復活)できます。<br>作成される項目は、必須かつ一意制約の条件で作成されます。";
$ary[103102] = "項番";
$ary[103103] = "マスタ項目作成情報";
$ary[103104] = "マスタ項目作成情報";
$ary[103105] = "メニュー名";
$ary[103106] = "パラメータを紐付けするメニューをプルダウンから選択します。";
$ary[103107] = "項目名";
$ary[103108] = "メニューに表示する項目名を入力します。";
$ary[103109] = "表示順序";
$ary[103110] = "メニューに表示されるカラムの順序を入力します。左から昇順に表示されます。";
$ary[103111] = "最大バイト数";
$ary[103112] = "最大バイト数を入力します。
半角英数字なら文字数分となります。
全角文字ならば文字数×３＋２バイト必要になります。
一つのメニューに紐付けできる合計のバイト数(53460Byte)を超過すると、エラーになります。";
$ary[103113] = "正規表現";
$ary[103114] = "正規表現で入力制限を行いたい場合に設定します。\n例：\n半角数字のみ（値なしも許容）：/^[0-9]*$/\n半角英数字のみ（値必須）：/^[a-zA-Z0-9]+$/";
$ary[103115] = "説明";
$ary[103116] = "項目名をマウスオーバーした際に表示される説明を入力します。";
$ary[103201] = "作成したメニューとDBのテーブルの紐付けを表示します。";
$ary[103202] = "項番";
$ary[103203] = "パラメータシート・テーブル紐付";
$ary[103204] = "パラメータシート・テーブル紐付";
$ary[103205] = "メニュー名";
$ary[103206] = "DBに紐付いているメニュー名です。";
$ary[103207] = "テーブル名";
$ary[103208] = "作成したメニューで使用するテーブル名です。";
$ary[103209] = "テーブル名(履歴)";
$ary[103210] = "作成したメニューで使用する履歴テーブル名です。";
$ary[103301] = "作成したメニューの項目名と、DBのカラム名の紐付けを表示します。";
$ary[103302] = "項番";
$ary[103303] = "テーブル項目名一覧";
$ary[103304] = "テーブル項目名一覧";
$ary[103305] = "メニュー名";
$ary[103306] = "紐付けするメニューの名称です。";
$ary[103307] = "項目名";
$ary[103308] = "メニューの項目名です。";
$ary[103309] = "カラム名";
$ary[103310] = "項目に対応するDBのカラム名です。";
$ary[103401] = "マスタ作成の状態を参照できます。";
$ary[103402] = "項番";
$ary[103403] = "マスタ作成管理";
$ary[103404] = "マスタ作成管理";
$ary[103405] = "メニュー名";
$ary[103406] = "作成対象のメニュー名です。";
$ary[103407] = "ステータス";
$ary[103408] = "メニュー作成状況のステータスです。
未実行：メニュー作成前の状態
実行中：BackYardがメニュー作成処理を実行中
完了　：メニュー作成がが正常に完了
完了（異常）：メニュー作成時にエラー終了した状態";
$ary[103409] = "メニュー資材";
$ary[103410] = "メニューにて使用されるPHPファイルとSQLファイルです。";
$ary[103411] = "作成したメニュー";
$ary[103412] = "作成したメニュー";
$ary[103501] = "「マスタ作成情報」で指定したメニューグループにマスタのメニューを作成します。<br/>
※既に同じメニュー名のメニューや「マスタ作成情報」の項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。<br/>
入力済みのデータが必要な場合は、「キャンセル」を選択してデータをバックアップしてください。";
$ary[103502] = "マスタ作成";
$ary[103503] = "マスタ作成開始";
$ary[103504] = "作成対象がありません。";
$ary[103505] = "全てをチェック";
$ary[103506] = "マスタ作成を受付ました。";
$ary[103507] = "項番";
$ary[103508] = "マスタ作成管理";
$ary[103509] = "作成するマスタを選択してください。";
$ary[103510] = "マスタ作成を実行しますか？\\n\\n※既に同じメニュー名のメニューや「マスタ作成情報」の項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。\\n入力済みのデータが必要な場合は、「キャンセル」を選択してデータをバックアップしてください。";
$ary[103601] = "作成するパラメータシートのカラムグループをメンテナンス(参照/更新/廃止/復活)できます。";
$ary[103602] = "項番";
$ary[103603] = "カラムグループ管理";
$ary[103604] = "カラムグループ管理";
$ary[103605] = "親カラムグループ";
$ary[103606] = "親カラムグループをプルダウンから選択します。";
$ary[103607] = "カラムグループ名";
$ary[103608] = "カラムグループ名を入力します。";
$ary[103609] = "カラムグループ";
$ary[103610] = "親カラムグループとカラムグループ名が結合された値が表示されます。";
$ary[104001] = "パラメータシートの繰り返し項目を縦に管理するメニュー情報をメンテナンス(参照/更新/廃止/復活)できます。";
$ary[104002] = "項番";
$ary[104003] = "パラメータシート(縦)作成情報";
$ary[104004] = "パラメータシート(縦)作成情報";
$ary[104005] = "メニュー名:開始項目名";
$ary[104006] = "作成する縦メニューの元になるメニューと、繰り返し項目の開始の項目名を指定します。";
$ary[104007] = "項目数";
$ary[104008] = "項目数を指定します。";
$ary[104009] = "繰り返し数";
$ary[104010] = "繰り返し数を指定します。";
$ary[104101] = "パラメータシートの縦メニューから横メニューへの変換情報を参照できます。";
$ary[104102] = "項番";
$ary[104103] = "パラメータシート縦横変換管理";
$ary[104104] = "パラメータシート縦横変換管理";
$ary[104105] = "変換元メニュー名";
$ary[104106] = "変換元のメニューグループ：メニューを表示します。";
$ary[104107] = "変換先メニュー名";
$ary[104108] = "変換先のメニューグループ：メニューを表示します。";
$ary[104109] = "用途";
$ary[104110] = "メニューの用途を入力します。";
$ary[104111] = "繰り返し開始カラム名";
$ary[104112] = "横メニューの繰り返し開始カラム名を表示します。";
$ary[104113] = "項目数";
$ary[104114] = "項目数を指定します。";
$ary[104115] = "繰り返し数";
$ary[104116] = "繰り返し数を指定します。";
$ary[104117] = "縦横変換済みフラグ";
$ary[104118] = "縦横変換済みフラグを指定します。";
?>