<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITATERRAFORM_STD
$ary[99999] = "ダミー";
$ary[201010] = "予約を取り消しました。ステータスをご確認下さい。(作業No.:{})";
$ary[201020] = "緊急停止しました。ステータスをご確認下さい。(作業No.:{})";
$ary[201030] = "planおよびapplyはキャンセルできない状態です。(作業No.:{})";
$ary[50001] = "プロシージャ開始";
$ary[50002] = "プロシージャ終了(正常)";
$ary[50003] = "DBコネクト完了";
$ary[50004] = "処理対象レコード無し";
$ary[50005] = "処理対象レコード検出(EXECUTION_NO:{})";
$ary[50006] = "ステータス「準備中」へのUPDATEループ開始";
$ary[50007] = "[処理]UPDATE実行(ステータス＝「準備中」)(作業No.:{})";
$ary[50008] = "ステータス「準備中」へのUPDATEループ終了";
$ary[50009] = "コミット(ステータスを「準備中」に変更する処理)";
$ary[50010] = "処理対象レコードの処理ループ開始";
$ary[50011] = "処理対象レコードの処理ループ終了";
$ary[50012] = "[処理]レコードロック(作業No.:{})";
$ary[50013] = "[処理]UPDATE実行(ステータス＝「準備中」)(作業No.:{})";
$ary[50014] = "[処理]コミット(作業No.:{})";
$ary[50015] = "[処理]UPDATE実行(ステータス＝「想定外エラー」)(作業No.:{})";
$ary[60001] = "トランザクション開始(ステータスを「準備中」に変更する処理)";
$ary[60002] = "トランザクション終了(ステータスを「準備中」に変更する処理)";
$ary[60003] = "[処理]トランザクション開始(作業No.:{})";
$ary[60004] = "[処理]トランザクション終了(作業No.:{})";
$ary[60005] = "トランザクション開始(作業No.:{})";
$ary[60006] = "トランザクション終了(作業No.:{})";
$ary[60007] = "トランザクション開始";
$ary[60008] = "トランザクション終了";
$ary[60009] = "ロールバック(作業No.:{})";
$ary[60010] = "ロールバック";
$ary[70001] = "プロシージャ開始";
$ary[70002] = "プロシージャ終了(正常)";
$ary[70003] = "DBコネクト完了";
$ary[70004] = "処理対象レコード無し";
$ary[70005] = "処理対象レコード検出(EXECUTION_NO:{})";
$ary[70006] = "処理対象レコードの処理ループ開始";
$ary[70007] = "処理対象レコードの処理ループ終了";
$ary[70008] = "[処理]遅延を検出(作業No.:{})";
$ary[70009] = "[処理]UPDATE実行(作業No.:{})";
$ary[70010] = "コミット(ステータスを変更する処理)";
$ary[70011] = "[処理]コミット(作業No.:{})";
$ary[70012] = "[処理]UPDATE実行(ステータス＝「想定外エラー」)(作業No.:{})";
$ary[80001] = "トランザクション開始(ステータスを変更する処理)(作業No.:{})";
$ary[80002] = "トランザクション終了(ステータスを変更する処理)(作業No.:{})";
$ary[80003] = "[処理]トランザクション開始(作業No.:{})";
$ary[80004] = "[処理]トランザクション終了(作業No.:{})";
$ary[80005] = "トランザクション開始(作業No.:{})";
$ary[80006] = "トランザクション終了(作業No.:{})";
$ary[80007] = "トランザクション開始";
$ary[80008] = "トランザクション終了";
$ary[80009] = "ロールバック(作業No.:{})";
$ary[80010] = "ロールバック";
$ary[80011] = "Plan確認のためApplyを実行せず終了します。(作業No.:{})";
$ary[80012] = "Applyを実行します。(作業No.:{})";
$ary[90001] = "プロシージャ開始";
$ary[90002] = "プロシージャ終了(正常)";
$ary[90003] = "DBコネクト完了";
$ary[90004] = "Module変数紐付更新";
$ary[90005] = "Module変数紐付廃止";
$ary[100001] = "[処理]トランザクション開始";
$ary[100002] = "[処理]トランザクション終了";
$ary[100003] = "[処理]コミット";
$ary[100004] = "[処理]ロールバック";
$ary[110001] = "[処理]関連データベースに変更があるか確認";
$ary[110002] = "[処理]関連データベースに変更がないので処理終了";
$ary[110003] = "[処理]関連データベースの更新の反映完了を登録";
$ary[110004] = "[処理]関連データベースを更新したのでバックヤード処理(valautostup-workflow)の起動を登録";
$ary[110005] = "[処理]関連データベースを更新したのでバックヤード処理(varsautolistup-workflow)の起動を登録";
$ary[120001] = "[処理]代入値自動登録設定からカラム毎の変数の情報を取得";
$ary[120002] = "[処理]紐付対象メニューから具体値を取得";
$ary[120003] = "[処理]一般変数を紐付けている紐付対象メニューの具体値を代入値管理に登録";
$ary[120004] = "[処理]代入値管理から不要なデータを削除";
$ary[120005] = "[処理]紐付対象メニューから具体値を取得（MENU_ID:{}）";
$ary[120006] = "[処理]代入値管理 追加 (OPERATION_ID:{} PATTERN_ID:{} MODULE_VARS_LINK_ID:{})";
$ary[120007] = "[処理]代入値管理 復活 (OPERATION_ID:{} PATTERN_ID:{} MODULE_VARS_LINK_ID:{})";
$ary[120008] = "[処理]代入値管理 更新 (OPERATION_ID:{} PATTERN_ID:{} MODULE_VARS_LINK_ID:{})";
$ary[120009] = "[処理]代入値管理 更新不要 (OPERATION_ID:{} PATTERN_ID:{} MODULE_VARS_LINK_ID:{})";
$ary[120010] = "[処理]代入値管理 廃止 (ASSIGN_ID:{})";
$ary[120011] = "[処理]代入値管理 最終更新者が自分でないので廃止スキップ (ASSIGN_ID:{})";
$ary[120012] = "[処理]代入値管理 最終更新者が自分でないので更新スキップ (OPERATION_ID:{} PATTERN_ID:{} MODULE_VARS_LINK_ID:{})";
$ary[130001] = "[処理]トランザクション開始";
$ary[130002] = "[処理]トランザクション終了";
$ary[130003] = "[処理]コミット";
$ary[130004] = "[処理]ロールバック";
?>