<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITABASEH_STD
$ary[9999999] = "ダミー";
$ary[101010] = "Symphonyの現在のMovementのシーケンスを調査します。(SymphonyインスタンスID:{})";
$ary[101020] = "Symphonyの現在のMovementのシーケンスです。(Symphony:{}, Movement シーケンス:{})";
$ary[101030] = "[処理]新たなムーブメント起動判定(開始)";
$ary[101040] = "[処理]新たなムーブメント起動判定(終了)";
$ary[101050] = "[処理]シンフォニーへのステータス同期(開始)";
$ary[101060] = "[処理]シンフォニーへのステータス同期(終了)";
$ary[101080] = "[処理]ロールバック";
$ary[101090] = "トランザクション終了";
$ary[102010] = "[処理]ロールバック";
$ary[102020] = "トランザクション終了";
$ary[102030] = "[処理]ロールバック";
$ary[102040] = "トランザクション終了";
$ary[102050] = "[処理]ロールバック";
$ary[102060] = "トランザクション終了";
$ary[102070] = "[処理]ロールバック";
$ary[102080] = "トランザクション終了";
$ary[102090] = "[処理]ロールバック";
$ary[103010] = "トランザクション終了";
$ary[130040] = "電源ONコマンドを送信しました。";
$ary[10908003] = "Movementを単体実行できます。<br>・即時実行<br>・予約実行<br>が可能です。<br>実行時にはMovementとオペレーションIDを選択して下さい。";
$ary[10908005] = "説明";
$ary[10908010] = "スケジューリング";
$ary[10908015] = "予約日時を指定する場合は、日時フォーマット(YYYY/MM/DD HH:II)で入力して下さい。\nブランクの場合は即時実行となります";
$ary[10908020] = "予約日時";
$ary[10908025] = "Movement[フィルタ]";
$ary[10908030] = "Movement[一覧]";
$ary[10908035] = "オペレーション[フィルタ]";
$ary[10908040] = "オペレーション[一覧]";
$ary[10908045] = "MovementID";
$ary[10908050] = "Movement名";
$ary[10908055] = "オペレーションID";
$ary[10908060] = "オペレーション名";
$ary[9990010] = "管理コンソール";
$ary[9990020] = "基本コンソール";
$ary[9990030] = "Ansible-Legacyコンソール";
$ary[9990040] = "Ansible-Legacy-Roleコンソール";
$ary[9990050] = "Ansible-Pioneerコンソール";
$ary[9990060] = "Cobblerコンソール";
$ary[150000] = "150000";
$ary[150001] = "プロシージャ開始";
$ary[150002] = "プロシージャ終了(正常)";
$ary[150003] = "DBコネクト完了";
$ary[150004] = "[処理]トランザクション開始";
$ary[150005] = "[処理]トランザクション終了";
$ary[150006] = "[処理]コミット";
$ary[150007] = "[処理]ロールバック";
$ary[150010] = "投入オペレーション管理から保管期限切れのレコード廃止";
$ary[150011] = "Movement作業管理から保管期限切れのレコード廃止";
$ary[150012] = "Symphony作業管理から保管期限切れのレコード廃止";
$ary[150014] = "投入オペレーション管理から保管期限切れのレコード物理削除(テーブル名:{})";
$ary[150015] = "Symphony作業管理からオペレーションID紐付切れのレコード物理削除(テーブル名:{})";
$ary[150016] = "Symphony作業管理から保管期限切れのレコード物理削除(テーブル名:{})";
$ary[150017] = "Movement作業管理からオペレーションID紐付切れのレコードを物理削除します(テーブル名:{})";
$ary[150018] = "Movement作業管理から保管期限切れのレコード物理削除(テーブル名:{})";
$ary[1990000] = "[処理]トランザクション終了";
$ary[1990001] = "[処理]プロシージャ開始";
$ary[1990002] = "[処理]DBコネクト完了";
$ary[1990003] = "[処理]プロシージャ終了(正常)";
$ary[1990004] = "[処理]トランザクション開始";
$ary[1990005] = "[処理]トランザクション終了";
$ary[1990006] = "[処理]コミット";
$ary[1990007] = "[処理]ロールバック";
$ary[1990008] = "[処理] テーブルから保管期限切れデータの削除開始(テーブル名:{})";
$ary[1990009] = "[処理] テーブルから保管期限切れデータの削除完了(テーブル名:{})";
$ary[1990010] = "[処理] テーブルから保管期限切れレコードの廃止開始(テーブル名:{})";
$ary[1990011] = "[処理] テーブルから保管期限切れレコードの物理削除開始(テーブル名:{})";
$ary[1990012] = "[処理] テーブルから保存期間切れレコードの廃止(テーブル名:({}) オペレーション:({}) 主キー:({}))";
$ary[1990013] = "[処理] テーブルに紐づく不要ディレクトリ削除開始(テーブル名:({}) ディレクトリ名:({}))";
$ary[1990014] = "[処理] テーブルに紐づく不要ディレクトリ削除(テーブル名:({}) ディレクトリ名:({}))";
$ary[1990015] = "[処理](テーブル名:({}) 保存期限:({}))";
$ary[104010] = "緊急停止しました。ステータスをご確認下さい。(作業No.:{})";
$ary[900001] = "ファイルをアップロードしました。";
$ary[900002] = "データをインポートしました。";
$ary[900003] = "メニューインポート開始";
$ary[900004] = "未実行のタスクが0件のため、処理を終了しました(FILE:{}  LINE:{})";
$ary[900005] = "メニューインポート終了";
$ary[900006] = "不要ファイル削除処理開始";
$ary[900007] = "不要ファイル削除処理終了";
$ary[900008] = "インポート処理開始(FILE:{} LINE:{})";
$ary[900009] = "未実行レコード取得(FILE:{} LINE:{})";
$ary[900010] = "メニューIDに紐付くテーブル名取得(FILE:{} LINE:{})";
$ary[900011] = "テーブルバックアップ開始(FILE:{} LINE:{})";
$ary[900012] = "データベース接続情報取得(FILE:{} LINE:{})";
$ary[900013] = "ディレクトリ削除(ディレクトリ: {} FILE:{}  LINE:{})";
$ary[900014] = "シーケンス番号更新処理開始(FILE:{} LINE:{})";
$ary[900015] = "テーブル初期化(TABLE:{} FILE:{} LINE:{})";
$ary[900016] = "テーブルリストア(TABLE:{} FILE:{} LINE:{})";
$ary[900017] = "INSERT処理開始(FILE:{} LINE:{})";
$ary[900018] = "トランザクション開始(FILE:{} LINE:{})";
$ary[900019] = "コミット(FILE:{} LINE:{})";
$ary[900020] = "ファイルバックアップ開始(FILE:{} LINE:{})";
$ary[900021] = "ディレクトリとファイル一覧を取得(FILE:{} LINE:{})";
$ary[900022] = "ディレクトリとファイルのインポート開始(TASK_ID:{} FILE:{} LINE:{})";
$ary[900023] = "ディレクトリとファイルをリストア(TASK_ID:{} FILE:{} LINE:{})";
$ary[900024] = "ファイルコピーチェック(TASK_ID:{} FILE:{} LINE:{})";
$ary[900025] = "ステータス更新(TASK_ID:{} STATUS:{} FILE:{} LINE:{})";
$ary[900026] = "設定期間を過ぎても実行中のレコード件数を取得(FILE:{} LINE:{})";
$ary[900027] = "ディレクトリ削除(PATH:{} FILE:{} LINE:{})";
?>