<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITACREPAR_MNU
$ary[102001] = "パラメータシート/データシートをメンテナンス(参照/更新/廃止/復活)できます。<br>
「メインメニュー」というメニュー名は使用できません。";
$ary[102002] = "項番";
$ary[102003] = "メニュー定義一覧";
$ary[102004] = "メニュー定義一覧";
$ary[102005] = "メニュー名";
$ary[102006] = "作成するメニュー名を入力します。";
$ary[102007] = "表示順序";
$ary[102008] = "メニューグループに表示順序を入力します。昇順に表示されます。";
$ary[102009] = "用途";
$ary[102010] = "作成するメニューの用途を入力します。";
$ary[102011] = "入力用メニューグループ";
$ary[102012] = "入力用メニューの作成先メニューグループを入力します。";
$ary[102013] = "代入値自動登録用メニューグループ";
$ary[102014] = "代入値自動登録用メニューの作成先メニューグループを入力します。";
$ary[102015] = "参照用メニューグループ";
$ary[102016] = "参照用メニューの作成先メニューグループを入力します。";
$ary[102017] = "説明";
$ary[102018] = "メニュー画面の説明欄に表示する内容を入力します。";
$ary[102019] = "縦メニュー利用";
$ary[102020] = "縦メニューを利用する場合に入力します。";
$ary[102023] = "作成対象";
$ary[102026] = "「パラメータシート」を選択すると、代入値自動登録設定に設定されるパラメータシートメニューを作成します。
「データシート」を選択すると、代入値自動登録設定に設定されないデータシートメニューを作成します。";
$ary[102101] = "メニューで管理する項目をメンテナンス(参照/更新/廃止/復活)できます。";
$ary[102102] = "項番";
$ary[102103] = "メニュー項目作成情報";
$ary[102104] = "メニュー項目作成情報";
$ary[102105] = "メニュー名";
$ary[102106] = "パラメータを紐付けするメニューをプルダウンから選択します。";
$ary[102107] = "項目名";
$ary[102108] = "メニューに表示する項目名を入力します。";
$ary[102109] = "最大バイト数";
$ary[102110] = "最大バイト数を入力します。
[最大長]8192バイト
半角英数字なら文字数分となります。
全角文字ならば文字数×３＋２バイト必要になります。";
$ary[102111] = "表示順序";
$ary[102112] = "メニューに表示されるカラムの順序を入力します。左から昇順に表示されます。";
$ary[102113] = "必須";
$ary[102114] = "必須項目の場合は「●」を設定します。";
$ary[102115] = "正規表現";
$ary[102116] = "正規表現で入力制限を行いたい場合に設定します。\n例：\n半角数字のみ（値なしも許容）：/^[0-9]*$/\n半角英数字のみ（値必須）：/^[a-zA-Z0-9]+$/";
$ary[102117] = "説明";
$ary[102118] = "項目名をマウスオーバーした際に表示される説明を入力します。";
$ary[102119] = "一意制約";
$ary[102120] = "一意制約をつける場合は「●」を設定します。";
$ary[102121] = "入力方式";
$ary[102122] = "「文字列(単一行)」、「文字列(複数行)」、「整数」、「小数」、「日時」、「日付」、「プルダウン選択」、「パスワード」、「ファイルアップロード」、「リンク」から選択します。";
$ary[102123] = "メニューグループ：メニュー：項目";
$ary[102124] = "参照する項目を選択します。";
$ary[102125] = "文字列(単一行)";
$ary[102126] = "プルダウン選択";
$ary[102127] = "カラムグループ";
$ary[102128] = "所属するカラムグループを選択します。";
$ary[102129] = "整数";
$ary[102130] = "最大値";
$ary[102131] = "整数カラムの最大値を入力してください。未入力の場合は2147483647。";
$ary[102132] = "最小値";
$ary[102133] = "整数カラムの最小値を入力してください。未入力の場合は-2147483648。";
$ary[102134] = "小数";
$ary[102135] = "最大値";
$ary[102136] = "小数カラムの最大値を入力してください。未入力の場合は99999999999999。";
$ary[102137] = "最小値";
$ary[102138] = "小数カラムの最小値を入力してください。未入力の場合は-99999999999999。";
$ary[102139] = "桁数";
$ary[102140] = "小数カラムの整数・小数の合計桁数上限を入力してください。未入力の場合は14。";
$ary[102141] = "文字列(複数行)";
$ary[102142] = "パスワード";
$ary[102143] = "ファイルアップロード";
$ary[102144] = "ファイル最大バイト数";
$ary[102145] = "アップロード可能なファイルの最大バイト数を入力します。
[最大長]4294967296バイト(4Gバイト)";
$ary[102146] = "リンク";
$ary[102147] = "参照項目";
$ary[102148] = "「プルダウン選択」で選んだメニュー項目を元に、ほかの項目を参照します。参照する項目のIDをカンマ区切りで入力します。";
$ary[102201] = "作成したメニューとDBのテーブルの紐付けを表示します。";
$ary[102202] = "項番";
$ary[102203] = "メニュー・テーブル紐付";
$ary[102204] = "メニュー・テーブル紐付";
$ary[102205] = "メニューグループ：メニュー";
$ary[102206] = "作成したメニュー名です。";
$ary[102207] = "テーブル名";
$ary[102208] = "作成したテーブル名です。";
$ary[102209] = "主キー";
$ary[102210] = "作成したテーブルの主キーです。";
$ary[102211] = "テーブル名(履歴)";
$ary[102212] = "作成した履歴テーブル名です。";
$ary[102401] = "メニュー作成の状態を参照できます。";
$ary[102402] = "項番";
$ary[102403] = "メニュー作成履歴";
$ary[102404] = "メニュー作成履歴";
$ary[102405] = "メニュー名";
$ary[102406] = "作成対象のメニュー名です。";
$ary[102407] = "ステータス";
$ary[102408] = "メニュー作成状況のステータスです。
未実行：メニュー作成前の状態
実行中：BackYardがメニュー作成処理を実行中
完了　：メニュー作成が正常に完了
完了（異常）：メニュー作成時にエラー終了した状態";
$ary[102409] = "メニュー資材";
$ary[102410] = "メニューにて使用されるPHPファイルとSQLファイルです。";
$ary[102411] = "作成したメニュー";
$ary[102412] = "作成したメニュー";
$ary[102413] = "メニュー作成タイプ";
$ary[102414] = "メニュー作成のタイプです。
新規作成：新しくメニューを作成
初期化：既存のメニューを初期化して再作成
編集：登録済みのデータを残したままメニューを編集";
$ary[102501] = "「メニュー定義一覧」メニューで指定したメニューグループにメニューを作成します。<br/>※既に同じメニュー名のメニューや「メニュー定義一覧」メニューの項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。<br>入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary[102502] = "メニュー作成";
$ary[102503] = "メニュー作成開始";
$ary[102504] = "作成対象がありません。";
$ary[102505] = "全てをチェック";
$ary[102506] = "メニュー作成を受付ました。";
$ary[102507] = "項番";
$ary[102508] = "メニュー作成履歴";
$ary[102509] = "作成するメニューを選択してください。";
$ary[102510] = "メニュー作成を実行しますか？\\n\\n※既に同じメニュー名のメニューや「メニュー定義一覧」メニューの項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。\\n入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary[102601] = "ホスト名";
$ary[102602] = "ホストグループ名";
$ary[102603] = "オペレーション";
$ary[102604] = "実施予定日時";
$ary[102605] = "[元データ]基本コンソール/オペレーション一覧";
$ary[102606] = "ID";
$ary[102607] = "[元データ]基本コンソール/オペレーション一覧";
$ary[102608] = "オペレーション名";
$ary[102609] = "[元データ]基本コンソール/オペレーション一覧";
$ary[102610] = "オペレーション";
$ary[102611] = "基本コンソール/オペレーション一覧の「実施予定日時」、「オペレーションID」、「オペレーション名」を結合した値";
$ary[102612] = "パラメータ";
$ary[102613] = "代入順序";
$ary[102614] = "メニューの縦メニューから横メニューに変換する際に、左から昇順で入力されます。";
$ary[102615] = "基準日時";
$ary[102616] = "基本コンソール/オペレーション一覧の「最終実行日時」に値がある場合は「最終実行日時」、値が無い場合は「実施予定日時」";
$ary[102617] = "最終実行日時";
$ary[102618] = "[元データ]基本コンソール/オペレーション一覧";
$ary[102701] = "「メニュー項目作成情報」メニューの「他メニュー参照」で選択する項目を作成するためのメニュー<br/>自動で作成される。";
$ary[102702] = "項番";
$ary[102703] = "他メニュー連携";
$ary[102704] = "他メニュー連携";
$ary[102705] = "メニューグループ";
$ary[102706] = "";
$ary[102707] = "メニュー";
$ary[102708] = "";
$ary[102709] = "項目名";
$ary[102710] = "";
$ary[102711] = "メニューグループ：メニュー：項目名";
$ary[102712] = "";
$ary[102713] = "テーブル名";
$ary[102714] = "";
$ary[102715] = "主キー";
$ary[102716] = "";
$ary[102717] = "カラム名";
$ary[102718] = "";
$ary[102719] = "メニューグループ：メニュー";
$ary[102720] = "";
$ary[103601] = "作成するメニューのカラムグループをメンテナンス(参照/更新/廃止/復活)できます。";
$ary[103602] = "項番";
$ary[103603] = "カラムグループ管理";
$ary[103604] = "カラムグループ管理";
$ary[103605] = "親カラムグループ";
$ary[103606] = "親カラムグループをプルダウンから選択します。";
$ary[103607] = "カラムグループ名";
$ary[103608] = "カラムグループ名を入力します。";
$ary[103609] = "カラムグループ";
$ary[103610] = "親カラムグループとカラムグループ名が結合された値が表示されます。";
$ary[104001] = "メニューの繰り返し項目を縦に管理するメニュー情報をメンテナンス(参照/更新/廃止/復活)できます。";
$ary[104002] = "項番";
$ary[104003] = "縦メニュー作成情報";
$ary[104004] = "縦メニュー作成情報";
$ary[104005] = "メニュー名:開始項目名";
$ary[104006] = "作成する縦メニューの元になるメニューと、繰り返し項目の開始の項目名を指定します。";
$ary[104007] = "項目数";
$ary[104008] = "項目数を指定します。";
$ary[104009] = "繰り返し数";
$ary[104010] = "繰り返し数を指定します。";
$ary[104101] = "メニューの縦メニューから横メニューへの変換情報を参照できます。";
$ary[104102] = "項番";
$ary[104103] = "メニュー縦横変換管理";
$ary[104104] = "メニュー縦横変換管理";
$ary[104105] = "変換元メニュー名";
$ary[104106] = "変換元のメニューグループ：メニューを表示します。";
$ary[104107] = "変換先メニュー名";
$ary[104108] = "変換先のメニューグループ：メニューを表示します。";
$ary[104109] = "用途";
$ary[104110] = "メニューの用途を入力します。";
$ary[104111] = "繰り返し開始カラム名";
$ary[104112] = "横メニューの繰り返し開始カラム名を表示します。";
$ary[104113] = "項目数";
$ary[104114] = "項目数を指定します。";
$ary[104115] = "繰り返し数";
$ary[104116] = "繰り返し数を指定します。";
$ary[104117] = "縦横変換済みフラグ";
$ary[104118] = "縦横変換済みフラグを指定します。";
$ary[104201] = "項目";
$ary[104202] = "グループ";
$ary[104203] = "リピート";
$ary[104204] = "取り消し";
$ary[104205] = "やり直し";
$ary[104206] = "プレビュー";
$ary[104207] = "ログ";
$ary[104208] = "一覧(プレビュー)";
$ary[104209] = "メニュー作成情報";
$ary[104210] = "基本情報";
$ary[104211] = "項番";
$ary[104212] = "メニュー名";
$ary[104213] = "作成対象";
$ary[104214] = "表示順序";
$ary[104215] = "用途";
$ary[104216] = "最終更新日時";
$ary[104217] = "最終更新者";
$ary[104218] = "対象メニューグループ";
$ary[104219] = "ホスト";
$ary[104220] = "ホストグループ";
$ary[104221] = "参照";
$ary[104222] = "縦メニュー";
$ary[104223] = "データシート";
$ary[104224] = "説明";
$ary[104225] = "備考";
$ary[104226] = "作成";
$ary[104227] = "編集";
$ary[104228] = "流用新規";
$ary[104229] = "メニュー作成履歴";
$ary[104230] = "再読込";
$ary[104231] = "キャンセル";
$ary[104232] = "メニュー定義/作成";
$ary[104233] = "自動入力";
$ary[104234] = "メニューグループ選択";
$ary[104235] = "は必須項目です。";
$ary[104237] = "ホストグループ利用";
$ary[104238] = "縦メニュー利用";
$ary[104239] = "入力用";
$ary[104240] = "代入値自動登録用";
$ary[104241] = "参照用";
$ary[104242] = "利用する";
$ary[104243] = "アクセス許可ロール";
$ary[104244] = "ロール";
$ary[104245] = "アクセス許可ロール選択";
$ary[104246] = "縦メニューとは、同じパラメータを繰り返して定義する場合に視認性をよくするためのメニューです。";
$ary[104247] = "通常のメニューでは、項目数が多い場合は横長なメニューとなりますが、縦メニューでは同一項目を縦に表示して項目全体を見やすくしています。";
$ary[104248] = "※縦メニューの場合、入力用・代入値自動登録用メニューは以下のようになります。";
$ary[104249] = "入力用";
$ary[104250] = "代入値自動登録用";
$ary[104251] = "縦メニュー";
$ary[104252] = "縦メニューから通常メニュー（横表示）に自動的に変換したメニュー";
$ary[104253] = "/menus/systems/2100160011/imgs/vertical-menu-help-jp.png";
$ary[104254] = "通常メニューと縦メニュー";
$ary[104255] = "初期化";
$ary[104256] = "作成(編集)";
$ary[104257] = "作成(初期化)";
$ary[104258] = "ホストグループまたはホストを選択";
$ary[104259] = "ホストを選択";
$ary[105001] = "他メニュー連携ID";
$ary[105002] = "";
$ary[105003] = "表示順序";
$ary[105004] = "";
$ary[105005] = "テーブル名";
$ary[105006] = "";
$ary[105007] = "主キー";
$ary[105008] = "";
$ary[105009] = "カラム名";
$ary[105010] = "";
$ary[105011] = "項目名";
$ary[105012] = "";
$ary[105013] = "カラムグループ";
$ary[105014] = "";
$ary[105015] = "説明";
$ary[105016] = "";
$ary[105017] = "入力方式";
$ary[105018] = "";
$ary[105019] = "Sensitive設定";
$ary[105020] = "";
$ary[105021] = "マスターカラム";
$ary[105022] = "";
?>