<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITACREPAR_ERR
$ary[1001] = "「メインメニュー」は設定できません。";
$ary[1003] = "ホストグループ機能がインストールされていないため、「ホストグループ用」は設定できません。";
$ary[1005] = "他のメニューグループと同じ値は設定できません。";
$ary[1006] = "以下の計算式に当てはまるように設定してください。\n同一メニュー名のサイズ(「最大バイト数」 * 3 + 2)の合計　≦　53460";
$ary[1007] = "メニュー項目作成情報テーブルの検索に失敗しました。SQLエラー=[{}]";
$ary[1008] = "実施予定日はYYYY/MM/DD形式で有効な日付を入力してください。";
$ary[1009] = "「文字列(単一行)」を設定した場合、「最大バイト数」は必須です。";
$ary[1010] = "「文字列(単一行)」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1011] = "「プルダウン選択」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1012] = "「プルダウン選択」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1013] = "「プルダウン選択」を設定した場合、「メニューグループ：メニュー：項目」は必須です。";
$ary[1014] = "自分のカラムグループは親カラムグループに選択できません。";
$ary[1015] = "ループ関係になるため選択不可です。";
$ary[1016] = "カラムグループ管理の検索に失敗しました。SQLエラー=[{}]";
$ary[1017] = "親カラムグループに選択されているため廃止できません。子カラムグループの項番=[{}]";
$ary[1018] = "「/」の文字は使用できません。";
$ary[1019] = "同一のメニューの項目は登録できません。項番=[{}]";
$ary[1020] = "「\/:*?\"<>|[]：￥／＊［］」の文字は使用できません。";
$ary[1021] = "PHP関数preg_matchの第1引数の形式で入力してください。";
$ary[1022] = "「パラメータシート(ホスト/オペレーションあり)」を設定した場合、「用途」は必須です。";
$ary[1023] = "「パラメータシート(ホスト/オペレーションあり)」を設定した場合、「代入値自動登録用メニューグループ」、「参照用メニューグループ」は必須です。";
$ary[1024] = "「縦メニュー利用」を設定した場合、「リピート」を設定してください。";
$ary[1026] = "「データシート」を設定した場合、「用途」は設定できません。";
$ary[1027] = "「データシート」を設定した場合、「縦メニュー利用」は設定できません。";
$ary[1028] = "「データシート」を設定した場合、「代入値自動登録用メニューグループ」「参照用メニューグループ」は設定できません。";
$ary[1034] = "「文字列(単一行)」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1035] = "「文字列(単一行)」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1036] = "「文字列(単一行)」を設定した場合、「整数最大値」は設定できません。";
$ary[1037] = "「文字列(単一行)」を設定した場合、「整数最小値」は設定できません。";
$ary[1038] = "「文字列(単一行)」を設定した場合、「小数最大値」は設定できません。";
$ary[1039] = "「文字列(単一行)」を設定した場合、「小数最小値」は設定できません。";
$ary[1040] = "「文字列(単一行)」を設定した場合、「小数桁数」は設定できません。";
$ary[1041] = "「文字列(単一行)」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1042] = "「文字列(単一行)」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1043] = "「プルダウン選択」を設定した場合、「整数最大値」は設定できません。";
$ary[1044] = "「プルダウン選択」を設定した場合、「整数最小値」は設定できません。";
$ary[1045] = "「プルダウン選択」を設定した場合、「小数最大値」は設定できません。";
$ary[1046] = "「プルダウン選択」を設定した場合、「小数最小値」は設定できません。";
$ary[1047] = "「プルダウン選択」を設定した場合、「小数桁数」は設定できません。";
$ary[1048] = "「整数」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1049] = "「整数」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1050] = "「整数」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1051] = "「整数」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1052] = "「整数」を設定した場合、「最大値」は「最小値」より大きい数値を入力してください。（範囲外です。最小値：{},最大値：{}）";
$ary[1053] = "「整数」を設定した場合、「小数最小値」は設定できません。";
$ary[1054] = "「整数」を設定した場合、「小数最大値」は設定できません。";
$ary[1055] = "「整数」を設定した場合、「小数桁数」は設定できません。";
$ary[1056] = "「整数」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1057] = "「小数」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1058] = "「小数」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1059] = "「小数」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1060] = "「小数」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1061] = "「小数」を設定した場合、「整数最小値」は設定できません。";
$ary[1062] = "「小数」を設定した場合、「整数最大値」は設定できません。";
$ary[1063] = "「小数」を設定した場合、「最大値」は「最小値」より大きい数値を入力してください。（範囲外です。最小値：{},最大値：{}）";
$ary[1064] = "「小数」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1065] = "「文字列(複数行)」を設定した場合、「文字列(複数行)最大バイト数」は必須です。";
$ary[1066] = "「文字列(複数行)」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1067] = "「文字列(複数行)」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1068] = "「文字列(複数行)」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1069] = "「文字列(複数行)」を設定した場合、「整数最大値」は設定できません。";
$ary[1070] = "「文字列(複数行)」を設定した場合、「整数最小値」は設定できません。";
$ary[1071] = "「文字列(複数行)」を設定した場合、「小数最大値」は設定できません。";
$ary[1072] = "「文字列(複数行)」を設定した場合、「小数最小値」は設定できません。";
$ary[1073] = "「文字列(複数行)」を設定した場合、「小数桁数」は設定できません。";
$ary[1074] = "「日時」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1075] = "「日時」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1076] = "「日時」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1077] = "「日時」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1078] = "「日時」を設定した場合、「整数最小値」は設定できません。";
$ary[1079] = "「日時」を設定した場合、「整数最大値」は設定できません。";
$ary[1080] = "「日時」を設定した場合、「小数最小値」は設定できません。";
$ary[1081] = "「日時」を設定した場合、「小数最大値」は設定できません。";
$ary[1082] = "「日時」を設定した場合、「小数桁数」は設定できません。";
$ary[1083] = "「日時」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1084] = "「日付」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1085] = "「日付」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1086] = "「日付」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1087] = "「日付」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1088] = "「日付」を設定した場合、「整数最小値」は設定できません。";
$ary[1089] = "「日付」を設定した場合、「整数最大値」は設定できません。";
$ary[1090] = "「日付」を設定した場合、「小数最小値」は設定できません。";
$ary[1091] = "「日付」を設定した場合、「小数最大値」は設定できません。";
$ary[1092] = "「日付」を設定した場合、「小数桁数」は設定できません。";
$ary[1093] = "「日付」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[5001] = "ファイルが存在しません。.ファイル=[{}]";
$ary[5002] = "ファイルの読込に失敗しました。.ファイル=[{}]";
$ary[5003] = "SQLの実行が失敗しました。SQLエラー=[{}]";
$ary[5004] = "ディレクトリの作成が失敗しました。ディレクトリ=[{}]";
$ary[5005] = "メニュー定義一覧が取得できませんでした。";
$ary[5006] = "メニュー項目作成情報が取得できませんでした。";
$ary[5007] = "ファイルの作成が失敗しました。ファイル=[{}]";
$ary[5008] = "ZIPファイルへのファイル追加で失敗しました。ZIPファイル=[{}]、追加ファイル=[{}]";
$ary[5009] = "ディレクトリの削除が失敗しました。ディレクトリ=[{}]";
$ary[5010] = "ファイルのコピーに失敗しました。コピー元=[{}]、コピー先=[{}]";
$ary[5011] = "パラメータ項目作成情報のカラムグループが特定できませんでした。項番=[{}]";
$ary[5012] = "マスタ作成情報が取得できませんでした。";
$ary[5013] = "マスタ項目作成情報が取得できませんでした。";
$ary[5014] = "メニュー(縦)作成情報が取得できませんでした。";
$ary[5015] = "メニュー(縦)作成情報の項目数と繰り返し数が不正です。";
$ary[5016] = "メニュー(縦)作成情報の設定による繰り返し項目で、入力方式が一致しません。";
$ary[5017] = "メニュー(縦)作成情報の項目数/繰り返し数がメニュー項目作成情報と不整合です。";
$ary[5018] = "メニュー(縦)作成情報の設定による繰り返し項目で、プルダウン選択のメニューグループ：メニュー：項目名が一致しません。";
$ary[5019] = "パラメータ項目作成情報のプルダウン選択が特定できませんでした。項番=[{}]";
$ary[1094] = "「文字列(単一行)」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1095] = "「文字列(複数行)」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1096] = "「整数」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1097] = "「小数」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1098] = "「日時」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1099] = "「日付」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1100] = "「プルダウン選択」を設定した場合、「パスワード最大バイト数」は設定できません。";
$ary[1101] = "「パスワード」を設定した場合、「最大バイト数」は必須です。";
$ary[1102] = "「パスワード」を設定した場合、「文字列(単一行)最大バイト数」は設定できません。";
$ary[1103] = "「パスワード」を設定した場合、「文字列(単一行)正規表現」は設定できません。";
$ary[1104] = "「パスワード」を設定した場合、「文字列(複数行)最大バイト数」は設定できません。";
$ary[1105] = "「パスワード」を設定した場合、「文字列(複数行)正規表現」は設定できません。";
$ary[1106] = "「パスワード」を設定した場合、「整数最大値」は設定できません。";
$ary[1107] = "「パスワード」を設定した場合、「整数最小値」は設定できません。";
$ary[1108] = "「パスワード」を設定した場合、「小数最大値」は設定できません。";
$ary[1109] = "「パスワード」を設定した場合、「小数最小値」は設定できません。";
$ary[1110] = "「パスワード」を設定した場合、「小数桁数」は設定できません。";
$ary[1111] = "「パスワード」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1112] = "「パラメータシート(オペレーションあり)」を設定した場合、「用途」は設定できません。";
$ary[1113] = "「パラメータシート(オペレーションあり)」を設定した場合、「代入値自動登録用メニューグループ」、「参照用メニューグループ」は必須です。";
?>