<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITAANSIBLEH_MNU
$ary[101035] = "項目";
$ary[101060] = "値";
$ary[101070] = "作業No.";
$ary[101075] = "実行種別";
$ary[101080] = "Movement";
$ary[101095] = "ID";
$ary[101096] = "名称";
$ary[102010] = "遅延タイマ(分)";
$ary[102011] = "Ansible利用情報";
$ary[102012] = "ホスト指定形式";
$ary[102013] = "WinRM接続";
$ary[102014] = "並列実行数";
$ary[102015] = "gather_facts";
$ary[102030] = "オペレーション";
$ary[102040] = "No.";
$ary[102050] = "名称";
$ary[102055] = "ID";
$ary[102060] = "入力データ";
$ary[102070] = "投入データ";
$ary[102080] = "出力データ";
$ary[102090] = "結果データ";
$ary[103010] = "作業状況";
$ary[103020] = "予約日時";
$ary[103030] = "開始日時";
$ary[103040] = "終了日時";
$ary[103050] = "ステータス";
$ary[103085] = "項目";
$ary[103090] = "値";
$ary[103100] = "実行ユーザ";
$ary[103110] = "呼出元Symphony";
$ary[104010] = "作業No.";
$ary[104015] = "実行種別";
$ary[104020] = "Movement";
$ary[104035] = "ID";
$ary[104036] = "名称";
$ary[104040] = "遅延タイマ(分)";
$ary[104041] = "Ansible利用情報";
$ary[104042] = "ホスト指定形式";
$ary[104043] = "並列実行数";
$ary[104060] = "オペレーション";
$ary[104070] = "No.";
$ary[104080] = "名称";
$ary[104085] = "ID";
$ary[104090] = "入力データ";
$ary[104100] = "実行ユーザ";
$ary[104110] = "呼出元Symphony";
$ary[105010] = "投入データ";
$ary[105020] = "出力データ";
$ary[105030] = "結果データ";
$ary[105040] = "作業状況";
$ary[105050] = "予約日時";
$ary[105060] = "開始日時";
$ary[105070] = "終了日時";
$ary[105080] = "ステータス";
$ary[105090] = "Playbookで使用するテンプレートファイルをメンテナンス(閲覧/登録/更新/廃止)できます。 <br><br>テンプレートファイル内の変数には接頭文字として「VAR_」を付与して下さい。<br>接頭文字が「VAR_」の変数が、代入値管理メニューにて選択可能になります。<br>(例) {{ VAR_OMCS }}";
$ary[106010] = "素材ID";
$ary[106020] = "Ansible テンプレート管理";
$ary[106030] = "Ansible テンプレート管理";
$ary[106040] = "テンプレート埋込変数名";
$ary[106045] = "(接頭文字TPF_)半角英数字と利用可能な記号（_）";
$ary[106050] = "接頭文字として必ず「TPF_」を付与して下さい。";
$ary[106060] = "テンプレート素材";
$ary[106070] = "テンプレートとして使用できるのは、Jinja2テンプレートファイルに限られます。\n(Ansible仕様)";
$ary[106075] = "変数定義";
$ary[106076] = "テンプレート素材で使用している変数(VAR_)の構造をYAML形式で定義します。
変数の構造は以下の３種類で定義可能です。
・変数名に対して具体値を１つ定義できる変数
    例
  　　VAR_sample: 
・変数名に対して具体値を複数定義できる変数
    例
    　VAR_sample: []
・階層化された変数
    例
      VAR_sample:
        name: 
        value:";
$ary[106077] = "多段変数や読替変数定義有無";
$ary[106078] = "多段変数や読替変数定義有無";
$ary[106080] = "表示順序";
$ary[106090] = "表示順序の制御用";
$ary[108020] = "作業一覧(実行履歴)を閲覧できます。 <br>「作業状態確認」を押下すると作業状態確認メニューに遷移します。";
$ary[108030] = "作業No.";
$ary[108040] = "Ansible(Legacy)作業管理";
$ary[108050] = "Ansible(Legacy)作業管理";
$ary[108060] = "作業状態確認";
$ary[108065] = "実行種別";
$ary[108066] = "実行種別には以下の状態が存在します。
・通常
・ドライラン";
$ary[108070] = "ステータス";
$ary[108080] = "ステータスには以下の状態が存在します。
・未実行
・準備中
・実行中
・実行中(遅延)
・完了
・完了(異常)
・想定外エラー
・緊急停止
・未実行(予約)
・予約取消";
$ary[108085] = "Movement";
$ary[108090] = "ID";
$ary[108100] = "実行ユーザ";
$ary[108110] = "[元データ]ユーザ管理";
$ary[108120] = "呼出元Symphony";
$ary[108130] = "[元データ]Symphonyクラス一覧";
$ary[109010] = "[元データ]Movement一覧";
$ary[109020] = "名称";
$ary[109030] = "[元データ]Movement一覧";
$ary[109035] = "オペレーション";
$ary[109040] = "No.";
$ary[109050] = "[元データ]投入オペレーション一覧";
$ary[109060] = "登録・更新不可";
$ary[109070] = "名称";
$ary[109080] = "[元データ]投入オペレーション一覧";
$ary[109085] = "ID";
$ary[109086] = "[元データ]投入オペレーション一覧";
$ary[109089] = "入力データ";
$ary[109090] = "投入データ";
$ary[201009] = "出力データ";
$ary[201010] = "結果データ";
$ary[201020] = "結果データ一式(zip)です。";
$ary[201029] = "作業状況";
$ary[201030] = "予約日時";
$ary[201040] = "";
$ary[201050] = "開始日時";
$ary[201060] = "";
$ary[201070] = "終了日時";
$ary[201080] = "";
$ary[201090] = "遅延タイマー";
$ary[202010] = "[元データ]Movement一覧";
$ary[202011] = "Ansible利用情報";
$ary[202012] = "ホスト指定形式";
$ary[202013] = "[元データ]Movement一覧";
$ary[202014] = "WinRM接続";
$ary[202015] = "[元データ]Movement一覧";
$ary[202016] = "並列実行数";
$ary[202017] = "NULLまたは正の整数";
$ary[202018] = "gather_facts";
$ary[202019] = "[元データ]Movement一覧";
$ary[202020] = "Ansibleサーバへの接続インターフェース情報をメンテナンス(閲覧/登録/更新/廃止)できます。 <br>本メニューは必ず1レコードである必要があります。";
$ary[202030] = "No.";
$ary[202040] = "Ansible(Legacy)インターフェース情報";
$ary[202050] = "Ansible(Legacy)インターフェース情報";
$ary[202060] = "データリレイストレージパス(ITA)";
$ary[202070] = "Ansibleサーバとの共有ディレクトリです。";
$ary[202080] = "データリレイストレージパス(ANS)";
$ary[202090] = "ITAサーバとの共有ディレクトリです。";
$ary[203010] = "プロトコル";
$ary[203020] = "http/httpsのいずれかです。";
$ary[203030] = "ホスト";
$ary[203040] = "Ansibleサーバのホスト名(またはIPアドレス)です。\n※https通信の場合は基本的にホスト名が推奨。";
$ary[203050] = "ポート";
$ary[203060] = "Ansibleサーバの接続ポートです。
通常は\nhttpの場合:80\nhttpsの場合443\nです。";
$ary[203070] = "Access_key_id";
$ary[203080] = "Ansibleサーバ接続時の認証に使用するアクセスキーIDです。";
$ary[203090] = "Secret_access_key";
$ary[204010] = "Ansibleサーバ接続時の認証に使用するシークレットアクセスキーです。";
$ary[204020] = "状態監視周期(単位ミリ秒)";
$ary[204030] = "作業実行時の作業ログをリフレッシュする間隔です。\n環境毎にチューニングを要しますが、通常は3000ミリ秒程度が推奨値です。";
$ary[204040] = "進行状態表示行数";
$ary[204050] = "作業実行時の作業ログ出力行数です。\n環境毎にチューニングを要しますが、通常は1000行程度が推奨値です。";
$ary[204060] = "表示順序";
$ary[204070] = "表示順序の制御用";
$ary[204080] = "オペレーションに紐付くMovementおよびホストをメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[204090] = "項番";
$ary[205010] = "Ansible(Legacy)作業対象ホスト";
$ary[205020] = "Ansible(Legacy)作業対象ホスト";
$ary[205030] = "オペレーション";
$ary[205040] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[205050] = "Movement";
$ary[205060] = "[元データ]Movement一覧";
$ary[205070] = "ホスト";
$ary[205080] = "[元データ]基本コンソール/機器一覧";
$ary[205090] = "表示順序";
$ary[206010] = "表示順序の制御用";
$ary[206020] = "Ansible-LegacyのMovementをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[206030] = "MovementID";
$ary[206040] = "Ansible(Legacy)Movement";
$ary[206050] = "Ansible(Legacy)Movement";
$ary[206060] = "Movement名";
$ary[206070] = "[最大長]256バイト";
$ary[206080] = "オーケストレータ";
$ary[206090] = "使用するオーケストレータが表示されます。";
$ary[207010] = "遅延タイマー";
$ary[207020] = "Movementが指定期間(分)を遅延した場合にステータスを遅延として警告します。";
$ary[207025] = "Ansible利用情報";
$ary[207030] = "ホスト指定形式";
$ary[207040] = "構築対象ノードの指定方法です。";
$ary[207043] = "WinRM接続";
$ary[207044] = "gather_facts";
$ary[207046] = "構築対象ノードがWindowsServerでWinRM接続する場合に選択します。";
$ary[207047] = "並列実行数";
$ary[207048] = "NULLまたは正の整数";
$ary[207049] = "Playbook実行時に構築対象ノードの情報(gather_facts)を取得したい場合に選択します。";
$ary[207050] = "表示順序";
$ary[207051] = "変数カウント";
$ary[207052] = "Movementで使用している変数のカウントが表示されます。";
$ary[207060] = "表示順序の制御用";
$ary[207070] = "選択";
$ary[207080] = "MovementにインクルードするPlaybookをメンテナンス(閲覧/登録/更新/廃止)できます。 <br>Movement実行時には複数のPlaybookをインクルード順序に従ってインクルードすることが可能です。";
$ary[207090] = "紐付項番";
$ary[208010] = "Ansible（Legacy）Movement詳細";
$ary[208020] = "Ansible（Legacy）Movement詳細";
$ary[208030] = "Movement";
$ary[208040] = "[元データ]Movement一覧";
$ary[208050] = "プレイブック素材";
$ary[208060] = "[元データ]プレイブック素材集";
$ary[208070] = "インクルード順序";
$ary[208080] = "";
$ary[208090] = "表示順序";
$ary[209010] = "表示順序の制御用";
$ary[209020] = "Ansible（Legacy）代入変数名管理";
$ary[209030] = "紐付項番";
$ary[209040] = "Ansible（Legacy）代入変数名管理";
$ary[209050] = "Ansible（Legacy）代入変数名管理";
$ary[209060] = "Movement";
$ary[209070] = "プルダウン選択";
$ary[209080] = "変数名";
$ary[209090] = "プルダウン選択";
$ary[301010] = "表示順序";
$ary[301020] = "表示順序の制御用";
$ary[301030] = "AnsibleのPlaybookをメンテナンス(閲覧/登録/更新/廃止)できます。<br><br>Playbook内の変数には接頭文字として「VAR_」を付与して下さい。<br>接頭文字が「VAR_」の変数が、代入値管理メニューにて選択可能になります。<br>(例) {{ VAR_OMCS }}\n\nまた、以下は予約変数となります。<br>基本コンソールの機器一覧メニューで管理している情報を代入することができます。<br>[ログインユーザID]<br>{{ __loginuser__ }}<br>[ログインホスト名]<br>{{ __loginhostname__ }}";
$ary[301040] = "素材ID";
$ary[301050] = "Ansible(Legacy)プレイブック素材集";
$ary[301060] = "Ansible(Legacy)プレイブック素材集";
$ary[301070] = "プレイブック素材名";
$ary[301080] = "[最大長]256バイト";
$ary[301090] = "プレイブック素材";
$ary[302010] = "[最大サイズ]20MB";
$ary[302020] = "表示順序";
$ary[302030] = "表示順序の制御用";
$ary[302040] = "オペレーションごとに、対象のMovementで利用されるPlaybookやテンプレートファイル内の変数「VAR_」に代入する具体値をメンテナンス(閲覧/登録/更新/廃止)できます。
";
$ary[302050] = "項番";
$ary[302060] = "Ansible（Legacy）代入値管理";
$ary[302070] = "Ansible（Legacy）代入値管理";
$ary[302080] = "オペレーション";
$ary[302090] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[302095] = "Movement：変数";
$ary[303010] = "Movement";
$ary[303020] = "[元データ]Movement一覧";
$ary[303030] = "オペレーションを選択して下さい";
$ary[303040] = "ホスト";
$ary[303050] = "[元データ]基本コンソール/機器一覧";
$ary[303060] = "オペレーションを選択して下さい";
$ary[303070] = "変数名";
$ary[303080] = "Playbook及びテンプレートから自動取得";
$ary[303090] = "Movementを選択して下さい";
$ary[304010] = "具体値";
$ary[304020] = "[最大長]1024バイト";
$ary[304030] = "表示順序";
$ary[304040] = "表示順序の制御用";
$ary[304050] = "[オペレーション,Movement,ホスト,変数名]の組み合わせが不正です。";
$ary[304051] = "代入順序";
$ary[304052] = "ブランクまたは正の整数\n記載あり:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入値が昇順で代入されたのちブランクの代入値が代入される";
$ary[304060] = "Ansible（Legacy）変数名管理";
$ary[304070] = "項番";
$ary[304080] = "Ansible（Legacy）変数名管理";
$ary[304090] = "Ansible（Legacy）変数名管理";
$ary[305010] = "変数名";
$ary[305011] = "[最大長]256バイト";
$ary[305020] = "変数名説明";
$ary[305030] = "シングルラインテキスト入力";
$ary[305040] = "表示順序";
$ary[305050] = "表示順序の制御用";
$ary[305060] = "OS種別ごとの対話ファイルをメンテナンス(閲覧/登録/更新/廃止)できます。<br><br>対話ファイル内の変数には接頭文字として「VAR_」を付与して下さい。<br>接頭文字が「VAR_」の変数が、代入値管理メニューにて選択可能になります。<br>(例) {{ VAR_OMCS }}<br><br>また、以下の変数は予約語となります。<br>基本コンソールの機器一覧メニューで管理している情報を代入することができます。<br>[プロトコル]<br>{{ __loginprotocol__ }}<br>[ログインユーザID]<br>{{ __loginuser__ }}<br>[ログインパスワード]<br>{{ __loginpassword__ }}<br>[ログインホスト名]<br>{{ __loginhostname__ }}";
$ary[305070] = "素材ID";
$ary[305080] = "Ansible(Pioneer)対話素材集";
$ary[305090] = "Ansible(Pioneer)対話素材集";
$ary[306010] = "対話種別";
$ary[306020] = "[元データ]対話種別リスト";
$ary[306030] = "OS種別";
$ary[306040] = "[元データ]基本コンソール/OS種別マスタ";
$ary[306050] = "対話ファイル素材";
$ary[306060] = "[最大サイズ]20MB";
$ary[306070] = "表示順序";
$ary[306080] = "表示順序の制御用";
$ary[306090] = "対話種別をメンテナンス(閲覧/登録/更新/廃止)できます。 <br>Ansible-Pioneerでは、OS種別ごとの差異を対話ファイルごとに定義し、同一目的の対話ファイルを対話種別として纏めて機器差分を吸収(抽象化)します。";
$ary[307010] = "項番";
$ary[307020] = "Ansible（pioneer）対話種別リスト";
$ary[307030] = "Ansible（pioneer）対話種別リスト";
$ary[307040] = "対話種別名";
$ary[307050] = "[最大長]256バイト";
$ary[307060] = "表示順序";
$ary[307070] = "表示順序の制御用";
$ary[308090] = "作業一覧(実行履歴)を閲覧できます。 <br>「作業状態確認」を押下すると作業状態確認メニューに遷移します。";
$ary[309010] = "作業No.";
$ary[309020] = "Ansible(Pioneer)作業管理";
$ary[309030] = "Ansible(Pioneer)作業管理";
$ary[309040] = "作業状態確認";
$ary[309045] = "実行種別";
$ary[309046] = "実行種別には以下の状態が存在します。
・通常
・ドライラン";
$ary[309050] = "ステータス";
$ary[309060] = "ステータスには以下の状態が存在します。
・未実行
・準備中
・実行中
・実行中(遅延)
・完了
・完了(異常)
・想定外エラー
・緊急停止
・未実行(予約)
・予約取消";
$ary[309065] = "Movement";
$ary[309070] = "ID";
$ary[309080] = "[元データ]Movement一覧";
$ary[309090] = "名称";
$ary[309100] = "実行ユーザ";
$ary[309110] = "[元データ]ユーザ管理";
$ary[309120] = "呼出元Symphony";
$ary[309130] = "[元データ]Symphonyクラス一覧";
$ary[401010] = "[元データ]Movement一覧";
$ary[401015] = "オペレーション";
$ary[401020] = "No.";
$ary[401030] = "[元データ]投入オペレーション一覧";
$ary[401031] = "並列実行数";
$ary[401032] = "NULLまたは正の整数";
$ary[401040] = "名称";
$ary[401050] = "[元データ]投入オペレーション一覧";
$ary[401055] = "ID";
$ary[401056] = "ID";
$ary[401059] = "入力データ";
$ary[401060] = "投入データ";
$ary[401070] = "投入データ一式(zip)です。";
$ary[401079] = "出力データ";
$ary[401080] = "結果データ";
$ary[401090] = "結果データ一式(zip)です。";
$ary[402009] = "作業状況";
$ary[402010] = "予約日時";
$ary[402020] = "[形式]YYYY/MM/DD HH:MM";
$ary[402030] = "開始日時";
$ary[402040] = "[形式]YYYY/MM/DD HH:MM:SS";
$ary[402050] = "終了日時";
$ary[402060] = "[形式]YYYY/MM/DD HH:MM:SS";
$ary[402070] = "遅延タイマー";
$ary[402080] = "[元データ]Movement一覧";
$ary[402081] = "Ansible利用情報";
$ary[402082] = "ホスト指定形式";
$ary[402083] = "[元データ]Movement一覧";
$ary[402090] = "Ansibleサーバへの接続インターフェース情報をメンテナンス(閲覧/登録/更新/廃止)できます。 <br>本メニューは必ず1レコードである必要があります。";
$ary[403010] = "No.";
$ary[403020] = "Ansible(Pioneer)インターフェース情報";
$ary[403030] = "Ansible(Pioneer)インターフェース情報";
$ary[403040] = "データリレイストレージパス(ITA)";
$ary[403050] = "Ansibleサーバとの共有ディレクトリを指定して下さい。";
$ary[403060] = "データリレイストレージパス(ANS)";
$ary[403070] = "ITAサーバとの共有ディレクトリです。";
$ary[403080] = "プロトコル";
$ary[403090] = "http/httpsのいずれかです。";
$ary[404010] = "ホスト";
$ary[404020] = "Ansibleサーバのホスト名(またはIPアドレス)を指定して下さい。\n※https通信の場合はホスト名である必要があります。";
$ary[404030] = "ポート";
$ary[404040] = "Ansibleサーバの接続ポートです。
通常は\nhttpの場合:80\nhttpsの場合443\nです。";
$ary[404050] = "Access_key_id";
$ary[404060] = "Ansibleサーバ接続時の認証に使用するアクセスキーIDを指定して下さい。";
$ary[404070] = "Secret_access_key";
$ary[404080] = "Ansibleサーバ接続時の認証に使用するシークレットアクセスキーです。";
$ary[404090] = "状態監視周期(単位ミリ秒)";
$ary[405010] = "作業実行時の作業ログをリフレッシュする間隔です。\n環境毎にチューニングを要しますが、通常は3000ミリ秒程度が推奨値です。";
$ary[405020] = "進行状態表示行数";
$ary[405030] = "作業実行時の作業ログ出力行数です。\n環境毎にチューニングを要しますが、通常は1000行程度が推奨値です。";
$ary[405040] = "表示順序";
$ary[405050] = "表示順序の制御用";
$ary[405060] = "Movementにインクルードする対話種別をメンテナンス(閲覧/登録/更新/廃止)できます。 <br>Movement実行時には複数の対話種別をインクルード順序に従ってインクルードすることが可能です。
";
$ary[405070] = "紐付項番";
$ary[405080] = "Ansible（Pioneer）Movement詳細";
$ary[405090] = "Ansible（Pioneer）Movement詳細";
$ary[406010] = "Movement";
$ary[406020] = "[元データ]Movement一覧";
$ary[406030] = "対話種別";
$ary[406040] = "[元データ]対話種別リスト";
$ary[406050] = "インクルード順序";
$ary[406060] = "";
$ary[406070] = "表示順序";
$ary[406080] = "表示順序の制御用";
$ary[406090] = "オペレーションに紐付くMovementおよびホストをメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[407010] = "項番";
$ary[407020] = "Ansible(Pioneer)作業対象ホスト";
$ary[407030] = "Ansible(Pioneer)作業対象ホスト";
$ary[407040] = "オペレーション";
$ary[407050] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[407060] = "Movement";
$ary[407070] = "[元データ]Movement一覧";
$ary[407080] = "ホスト";
$ary[407090] = "Ansibleサーバのホスト名(またはIPアドレス)を指定して下さい。\n※https通信の場合はホスト名である必要があります。";
$ary[408010] = "表示順序";
$ary[408020] = "表示順序の制御用";
$ary[408030] = "Ansible-PioneerのMovementをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[408040] = "MovementID";
$ary[408050] = "Ansible(Pioneer)Movement";
$ary[408060] = "Ansible(Pioneer)Movement";
$ary[408070] = "Movement名";
$ary[408080] = "[最大長]256バイト";
$ary[408090] = "オーケストレータ";
$ary[409010] = "使用するオーケストレータが表示されます。";
$ary[409020] = "遅延タイマー";
$ary[409030] = "Movementが指定期間(分)を遅延した場合にステータスを遅延として警告します。";
$ary[409035] = "Ansible利用情報";
$ary[409040] = "ホスト指定形式";
$ary[409050] = "構築対象ノードの指定方法です。";
$ary[409051] = "並列実行数";
$ary[409052] = "ansible-playbookコマンドの--forks=パラメータを設定します。";
$ary[409053] = "変数カウント";
$ary[409054] = "Movementで使用している変数のカウントが表示されます。";
$ary[409060] = "表示順序";
$ary[409070] = "表示順序の制御用";
$ary[409080] = "選択";
$ary[409090] = "Ansible（Pioneer）代入変数名管理";
$ary[501010] = "紐付項番";
$ary[501020] = "Ansible（Pioneer）代入変数名管理";
$ary[501030] = "Ansible（Pioneer）代入変数名管理";
$ary[501040] = "Movement";
$ary[501050] = "プルダウン選択";
$ary[501060] = "変数名";
$ary[501070] = "プルダウン選択";
$ary[501080] = "表示順序";
$ary[501090] = "表示順序の制御用";
$ary[502010] = "オペレーションごとに、対象のMovementで利用される対話ファイル内の変数「VAR_」に代入する具体値をメンテナンス(閲覧/登録/更新/廃止)できます。
";
$ary[502020] = "項番";
$ary[502030] = "Ansible（Pioneer）代入値管理";
$ary[502040] = "Ansible（Pioneer）代入値管理";
$ary[502050] = "オペレーション";
$ary[502060] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[502065] = "Movement：変数";
$ary[502066] = "Movement：変数";
$ary[502070] = "Movement";
$ary[502080] = "[元データ]Movement一覧";
$ary[502089] = "オペレーションを選択して下さい。";
$ary[502090] = "ホスト";
$ary[503010] = "[元データ]基本コンソール/機器一覧";
$ary[503019] = "オペレーションを選択して下さい。";
$ary[503020] = "変数名";
$ary[503030] = "対話ファイル及びテンプレートから自動取得";
$ary[503040] = "Movementを選択して下さい";
$ary[503050] = "具体値";
$ary[503060] = "[最大長]1024バイト";
$ary[503065] = "代入順序";
$ary[503066] = "ブランクまたは正の整数\n記載あり:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入値 が昇順で代入されたのちブランクの代入値が代入される";
$ary[503070] = "表示順序";
$ary[503080] = "表示順序の制御用";
$ary[503090] = "[オペレーション,Movement,ホスト,変数名]の組み合わせが不正です。";
$ary[504010] = "Ansible（Pioneer）変数名管理";
$ary[504020] = "項番";
$ary[504030] = "Ansible（Pioneer）変数名管理";
$ary[504040] = "Ansible（Pioneer）変数名管理";
$ary[504050] = "変数名";
$ary[504060] = "[最大長]256バイト";
$ary[504070] = "変数名説明";
$ary[504080] = "[最大長]256バイト";
$ary[504090] = "表示順序";
$ary[505010] = "表示順序の制御用";
$ary[505020] = "説明";
$ary[505030] = "対象作業";
$ary[505040] = "予約取消";
$ary[505050] = "予約取消";
$ary[505060] = "進行状況";
$ary[505070] = "緊急停止";
$ary[505080] = "緊急停止";
$ary[505090] = "登録した設定作業をモニターするメニューです。<br>作業の進行状況をリアルタイムで確認できるほか、緊急停止が可能です。";
$ary[506010] = "フィルタ";
$ary[506020] = "該当行のみ表示";
$ary[507050] = "説明";
$ary[507060] = "対象作業";
$ary[507070] = "予約取消";
$ary[507080] = "予約取消";
$ary[507090] = "進行状況";
$ary[508010] = "緊急停止";
$ary[508020] = "緊急停止";
$ary[508025] = "登録した設定作業をモニターするメニューです。<br>作業の進行状況をリアルタイムで確認できるほか、緊急停止が可能です。";
$ary[508030] = "フィルタ";
$ary[508040] = "該当行のみ表示";
$ary[509060] = "投入データ一式(zip)です。";
$ary[1101035] = "項目";
$ary[1101060] = "値";
$ary[1101070] = "作業No.";
$ary[1101075] = "実行種別";
$ary[1101080] = "Movement";
$ary[1101095] = "ID";
$ary[1101096] = "名称";
$ary[1102010] = "遅延タイマ(分)";
$ary[1102011] = "Ansible利用情報";
$ary[1102012] = "ホスト指定形式";
$ary[1102013] = "WinRM接続";
$ary[1102014] = "並列実行数";
$ary[1102015] = "gather_facts";
$ary[1102030] = "オペレーション";
$ary[1102040] = "No.";
$ary[1102050] = "名称";
$ary[1102055] = "ID";
$ary[1102060] = "入力データ";
$ary[1102070] = "投入データ";
$ary[1102080] = "出力データ";
$ary[1102090] = "結果データ";
$ary[1103010] = "作業状況";
$ary[1103020] = "予約日時";
$ary[1103030] = "開始日時";
$ary[1103040] = "終了日時";
$ary[1103050] = "ステータス";
$ary[1103100] = "実行ユーザ";
$ary[1103110] = "呼出元Symphony";
$ary[1108020] = "作業一覧(実行履歴)を閲覧できます。 <br>「作業状態確認」を押下すると作業状態確認メニューに遷移します。";
$ary[1108030] = "作業No.";
$ary[1108040] = "Ansible(Legacy Role)作業管理";
$ary[1108050] = "Ansible(Legacy Role)作業管理";
$ary[1108060] = "作業状態確認";
$ary[1108065] = "実行種別";
$ary[1108066] = "実行種別には以下の状態が存在します。\n
・通常\n
・ドライラン";
$ary[1108070] = "ステータス";
$ary[1108080] = "ステータスには以下の状態が存在します。
・未実行
・準備中
・実行中
・実行中(遅延)
・完了
・完了(異常)
・想定外エラー
・緊急停止
・未実行(予約)
・予約取消";
$ary[1108085] = "Movement";
$ary[1108090] = "ID";
$ary[1108100] = "実行ユーザ";
$ary[1108110] = "[元データ]ユーザ管理";
$ary[1108120] = "呼出元Symphony";
$ary[1108130] = "[元データ]Symphonyクラス一覧";
$ary[1109010] = "[元データ]Movement一覧";
$ary[1109020] = "名称";
$ary[1109030] = "[元データ]Movement一覧";
$ary[1109035] = "オペレーション";
$ary[1109040] = "No.";
$ary[1109050] = "[元データ]投入オペレーション一覧";
$ary[1109060] = "登録・更新不可";
$ary[1109070] = "名称";
$ary[1109080] = "[元データ]投入オペレーション一覧";
$ary[1109085] = "ID";
$ary[1109086] = "[元データ]投入オペレーション一覧";
$ary[1109089] = "入力データ";
$ary[1109090] = "投入データ";
$ary[1201009] = "出力データ";
$ary[1201010] = "結果データ";
$ary[1201020] = "結果データ一式(zip)です。";
$ary[1201029] = "作業状況";
$ary[1201030] = "予約日時";
$ary[1201040] = "";
$ary[1201050] = "開始日時";
$ary[1201060] = "";
$ary[1201070] = "終了日時";
$ary[1201080] = "";
$ary[1201090] = "遅延タイマー";
$ary[1202010] = "[元データ]Movement一覧";
$ary[1202011] = "Ansible利用情報";
$ary[1202012] = "ホスト指定形式";
$ary[1202013] = "[元データ]Movement一覧";
$ary[1202014] = "WinRM接続";
$ary[1202015] = "[元データ]Movement一覧";
$ary[1202016] = "並列実行数";
$ary[1202017] = "NULLまたは正の整数";
$ary[1202018] = "gather_facts";
$ary[1202019] = "[元データ]Movement一覧";
$ary[1202020] = "Ansibleサーバへの接続インターフェース情報をメンテナンス(閲覧/登録/更新/廃止)できます。 <br>本メニューは必ず1レコードである必要があります。";
$ary[1202030] = "";
$ary[1202040] = "Ansibleインターフェース情報";
$ary[1202050] = "Ansibleインターフェース情報";
$ary[1202060] = "データリレイストレージパス(ITA)";
$ary[1202070] = "ITAサーバとの共有ディレクトリです。";
$ary[1202080] = "データリレイストレージパス(Ansible)";
$ary[1202090] = "Ansible/Ansible Towerサーバとの共有ディレクトリです。";
$ary[1202095] = "Symphonyインスタンスデータリレイストレージパス(Ansible)";
$ary[1202096] = "Symphonyインスタンスの各Movementが共有するディレクトリをAnsible/Ansible Towerサーバで共有する為のパスです。";
$ary[1203010] = "プロトコル";
$ary[1203020] = "http/httpsのいずれかです。\nAnsible Towerはhttpsを入力します。";
$ary[1203030] = "ホスト";
$ary[1203040] = "AnsibleまたはAnsible Towerサーバのホスト名(またはIPアドレス)です。\n※https通信の場合は基本的にホスト名が推奨。";
$ary[1203050] = "ポート";
$ary[1203060] = "AnsibleまたはAnsible Towerサーバの接続ポートです。
通常は\nhttpの場合:80\nhttpsの場合443\nです。
Ansible Towerは443を入力します。";
$ary[1203065] = "実行エンジン";
$ary[1203066] = "実行するエンジンを選択します。";
$ary[1203070] = "Access_key_id";
$ary[1203080] = "Ansibleサーバ接続時の認証に使用するアクセスキーIDです。";
$ary[1203090] = "Secret_access_key";
$ary[1204010] = "Ansibleサーバ接続時の認証に使用するシークレットアクセスキーです。";
$ary[1204015] = "オプションパラメータ";
$ary[1204016] = "Movement共通のansible-playbookコマンドのオプションパラメータを設定します。
Movement固有のオプションパラメータはMovement一覧で設定します。
Ansible:
  ansible-playbookコマンドのパラメータを設定します。
　-i オプションはITAが設定します。

Ansible Tower:
　以下のパラメータが設定できます。
　　-verbosity
　　-f FORKS,--forks=FORKS
　　-l SUBSET,--limit=SUBSET
　　-e EXTRA_VARS,--extra-vars=EXTRA_VARS
        EXTRA_VARS:  変数名=具体値 変数名=具体値 .....
　　-t TAGS,--tags=TAGS
　　-b,--become
　　-D,--diff
　　--skip-tags=SKIP_TAGS
　　--start-at-task=START_AT_TASK
　以下はAnsible Tower独自のパラメータです。
　　-ufc,--use_fact_cache　　　ファクトのキャッシュの使用
　　-as,--allow_simultaneous　 同時実行ジョブの有効化
　　-jsc,--job_slice_count=　　JOB SLICING
　詳細はAnsible利用手順マニュアルを参照して下さい。";
$ary[1204017] = "実行ユーザー";
$ary[1204018] = "sudoコマンドでansible-playbookコマンドを実行するときの実行ユーザーです。
未入力の場合の実行ユーザーはrootです。";
$ary[1204020] = "状態監視周期(単位ミリ秒)";
$ary[1204030] = "作業実行時の作業ログをリフレッシュする間隔です。\n環境毎にチューニングを要しますが、通常は3000ミリ秒程度が推奨値です。";
$ary[1204040] = "進行状態表示行数";
$ary[1204050] = "作業実行時の作業ログ出力行数です。\n環境毎にチューニングを要しますが、通常は1000行程度が推奨値です。";
$ary[1204060] = "表示順序";
$ary[1204070] = "表示順序の制御用";
$ary[1204080] = "オペレーションに紐付くMovementおよびホストをメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[1204090] = "項番";
$ary[1205010] = "Ansible(Legacy Role)作業対象ホスト";
$ary[1205020] = "Ansible(Legacy Role)作業対象ホスト";
$ary[1205030] = "オペレーション";
$ary[1205040] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[1205050] = "Movement";
$ary[1205060] = "[元データ]Movement一覧";
$ary[1205070] = "ホスト";
$ary[1205080] = "[元データ]基本コンソール/機器一覧";
$ary[1205090] = "表示順序";
$ary[1206010] = "表示順序の制御用";
$ary[1206020] = "Ansible-Legacy RoleのMovementをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1206030] = "MovementID";
$ary[1206040] = "Ansible(Legacy Role)Movement";
$ary[1206050] = "Ansible(Legacy Role)Movement";
$ary[1206060] = "Movement名";
$ary[1206070] = "[最大長]256バイト";
$ary[1206080] = "オーケストレータ";
$ary[1206090] = "使用するオーケストレータが表示されます。";
$ary[1207010] = "遅延タイマー";
$ary[1207020] = "Movementが指定期間(分)を遅延した場合にステータスを遅延として警告します。";
$ary[1207025] = "Ansible利用情報";
$ary[1207030] = "ホスト指定形式";
$ary[1207040] = "構築対象ノードの指定方法です。";
$ary[1207047] = "並列実行数";
$ary[1207048] = "NULLまたは正の整数";
$ary[1207050] = "表示順序";
$ary[1207060] = "表示順序の制御用";
$ary[1207070] = "選択";
$ary[1207071] = "WinRM接続";
$ary[1207072] = "構築対象ノードがWindowsServerでWinRM接続する場合に選択します。";
$ary[1207073] = "gather_facts";
$ary[1207074] = "Playbook実行時に構築対象ノードの情報(gather_facts)を取得したい場合に選択します。";
$ary[1207075] = "変数カウント";
$ary[1207076] = "Movementで使用している変数のカウントが表示されます。";
$ary[1207080] = "MovementにインクルードするRoleをメンテナンス(閲覧/登録/更新/廃止)できます。 <br>Movement実行時には複数のRoleをインクルード順序に従ってインクルードすることが可能です。";
$ary[1207090] = "紐付項番";
$ary[1208010] = "Ansible（Legacy Role）Movement詳細";
$ary[1208020] = "Ansible（Legacy Role）Movement詳細";
$ary[1208030] = "Movement";
$ary[1208040] = "[元データ]Movement一覧";
$ary[1208045] = "ロールパッケージ名";
$ary[1208046] = "[元データ]ロールパッケージ管理";
$ary[1208050] = "ロール名";
$ary[1208060] = "ロールパッケージファイルから自動取得";
$ary[1208065] = "ロールパッケージ名：ロール名";
$ary[1208066] = "[元データ]ロールパッケージ一覧のロールパッケージファイルから自動取得";
$ary[1208070] = "インクルード順序";
$ary[1208080] = "";
$ary[1208090] = "表示順序";
$ary[1209010] = "表示順序の制御用";
$ary[1209011] = "ロールパッケージを選択して下さい";
$ary[1209012] = "[ロールパッケージ,ロール]の組み合わせが不正です。";
$ary[1209020] = "Ansible-Legacy RoleのMovementと変数名を紐付できます。 ";
$ary[1209030] = "紐付項番";
$ary[1209040] = "Ansible（Role）Movement変数紐付管理";
$ary[1209050] = "Ansible（Role）Movement変数紐付管理";
$ary[1209060] = "Movement";
$ary[1209070] = "[元データ]Movement一覧";
$ary[1209080] = "変数名";
$ary[1209090] = "[元データ]変数名一覧";
$ary[1301010] = "表示順序";
$ary[1301020] = "表示順序の制御用";
$ary[1302040] = "オペレーションごとに、対象のMovementで利用されるRole内のPlaybookやテンプレートファイル内の変数「VAR_」に代入する具体値をメンテナンス(閲覧/登録/更新/廃止)できます。
";
$ary[1302050] = "項番";
$ary[1302060] = "Ansible（Legacy Role）代入値管理";
$ary[1302070] = "Ansible（Legacy Role）代入値管理";
$ary[1302080] = "オペレーション";
$ary[1302090] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[1302095] = "Movement：変数";
$ary[1303010] = "Movement";
$ary[1303020] = "[元データ]Movement一覧";
$ary[1303030] = "オペレーションを選択して下さい";
$ary[1303040] = "ホスト";
$ary[1303050] = "[元データ]基本コンソール/機器一覧";
$ary[1303060] = "オペレーションを選択して下さい";
$ary[1303070] = "変数名";
$ary[1303080] = "Role内のPlaybook、テンプレート、及びデフォルト定義ファイルから自動取得";
$ary[1303090] = "Movementを選択して下さい";
$ary[1303091] = "メンバー変数名";
$ary[1303092] = "変数名で多段変数を指定した場合は入力必須。その他の場合は入力不可。";
$ary[1303093] = "変数名を選択して下さい";
$ary[1303094] = "列順序";
$ary[1303095] = "変数名で配列変数を指定した場合は入力必須。その他の場合は入力不可。";
$ary[1303096] = "入力不要";
$ary[1303097] = "入力不要";
$ary[1303098] = "入力不要";
$ary[1303099] = "入力不要";
$ary[1303100] = "グループ名";
$ary[1303101] = "グループがある場合は入力必須。その他の場合は入力不可。";
$ary[1304010] = "具体値";
$ary[1304020] = "[最大長]1024バイト";
$ary[1304030] = "表示順序";
$ary[1304040] = "表示順序の制御用";
$ary[1304041] = "デフォルト値";
$ary[1304042] = "defaults内で変数に紐付いている具体値が表示されます。";
$ary[1304050] = "[オペレーション,Movement,ホスト,変数名]の組み合わせが不正です。";
$ary[1304051] = "代入順序";
$ary[1304052] = "変数名で多段変数を指定した場合は入力不可。\nその他の場合は正の整数を入力。入力値が昇順で代入されます。\n具体値が複数ない場合でも正の整数を入力して下さい。";
$ary[1304054] = "選択されたメンバー変数は、多段変数のメンバーではありません。";
$ary[1304060] = "Ansible-Legacy Roleの変数名をメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1304070] = "項番";
$ary[1304080] = "Ansible（Legacy Role）変数名管理";
$ary[1304090] = "Ansible（Legacy Role）変数名管理";
$ary[1304111] = "変数が一般変数の場合は、メンバー変数の入力はできません。";
$ary[1304113] = "変数が一般変数の場合は、代入順序の入力はできません。";
$ary[1304141] = "変数が複数具体値変数の場合は、メンバー変数の入力はできません。";
$ary[1304143] = "変数が複数具体値変数の場合は、代入順序の入力は必須です。";
$ary[1304151] = "変数が多段変数の場合は、メンバー変数の入力は必須です。";
$ary[1304154] = "対象のメンバー変数は、代入順序の入力は必須です。";
$ary[1304155] = "対象のメンバー変数は、代入順序の入力はできません。";
$ary[1304200] = "次の項目が、[項番]:({})のレコードと重複しています。\n[(オペレーション),(Movement),(ホスト),(変数名)]";
$ary[1304201] = ",(メンバー変数名)]";
$ary[1304203] = ",(代入順序)]";
$ary[1305010] = "変数名";
$ary[1305013] = "[最大長]256バイト";
$ary[1305015] = "変数タイプ";
$ary[1305016] = "配列変数の場合は１を設定します。配列変数以外はブランクを設定します。\n";
$ary[1305020] = "変数名説明";
$ary[1305030] = "[最大長]256バイト";
$ary[1305040] = "表示順序";
$ary[1305050] = "表示順序の制御用";
$ary[1305060] = "グループ変数名";
$ary[1305070] = "";
$ary[1305080] = "グループ名";
$ary[1305090] = "";
$ary[1305100] = "多段変数項番";
$ary[1305110] = "";
$ary[1305120] = "代入順序有無";
$ary[1305130] = "有(1)/無(null)";
$ary[1305140] = "列順序有無";
$ary[1305150] = "有(1)/無(null)";
$ary[1505020] = "説明";
$ary[1505030] = "対象作業";
$ary[1505040] = "予約取消";
$ary[1505050] = "予約取消";
$ary[1505060] = "進行状況";
$ary[1505070] = "緊急停止";
$ary[1505080] = "緊急停止";
$ary[1505090] = "登録した設定作業をモニターするメニューです。<br>作業の進行状況をリアルタイムで確認できるほか、緊急停止が可能です。";
$ary[1506010] = "フィルタ";
$ary[1506020] = "該当行のみ表示";
$ary[1509060] = "投入データ一式(zip)です。";
$ary[1601010] = "Ansible（Legacy Role）ロールと変数名の紐付を行います。";
$ary[1601020] = "項番";
$ary[1601030] = "Ansible（Legacy Role）ロール変数名管理";
$ary[1601040] = "Ansible（Legacy Role）ロール変数名管理";
$ary[1601050] = "ロールパッケージ名";
$ary[1601060] = "[元データ]ロールパッケージ管理";
$ary[1601070] = "ロール名";
$ary[1601080] = "[元データ]ロール名管理";
$ary[1601090] = "変数名";
$ary[1602010] = "[最大長]256バイト";
$ary[1602020] = "表示順序";
$ary[1602030] = "表示順序の制御用";
$ary[1603010] = "Ansible-Legacy Roleのロール名とロールパッケージの紐付を行います。";
$ary[1603020] = "項番";
$ary[1603030] = "Ansible（Legacy Role）ロール名管理";
$ary[1603040] = "Ansible（Legacy Role）ロール名管理";
$ary[1603050] = "ロールパッケージ名";
$ary[1603060] = "[元データ]ロールパッケージ管理";
$ary[1603070] = "ロール名";
$ary[1603080] = "[最大長]1024バイト";
$ary[1603090] = "表示順序";
$ary[1604010] = "表示順序の制御用";
$ary[1605010] = "Ansible-Legacy Roleのロールパッケージをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1605020] = "項番";
$ary[1605030] = "Ansible（Legacy Role）ロールパッケージ管理";
$ary[1605040] = "Ansible（Legacy Role）ロールパッケージ管理";
$ary[1605050] = "ロールパッケージ名";
$ary[1605060] = "[最大長]256バイト";
$ary[1605070] = "ロールパッケージファイル(ZIP形式)";
$ary[1605080] = "[最大サイズ]20MB";
$ary[1605090] = "表示順序";
$ary[1701010] = "Ansible-Legacy Roleのメンバー変数をメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1701020] = "項番";
$ary[1701030] = "Ansible(Legacy Role)メンバー変数名管理";
$ary[1701040] = "Ansible(Legacy Role)メンバー変数名管理";
$ary[1702010] = "配列変数名";
$ary[1702020] = "";
$ary[1703010] = "メンバー変数名";
$ary[1703020] = "[最大長]1024バイト";
$ary[1704010] = "Ansible-Legacy Roleの変数具体値をメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1704020] = "項番";
$ary[1704030] = "Ansible(Legacy Role)変数具体値管理";
$ary[1704040] = "Ansible(Legacy Role)変数具体値管理";
$ary[1704050] = "ロールパッケージ";
$ary[1704060] = "";
$ary[1704070] = "ロール";
$ary[1704080] = "";
$ary[1704090] = "変数タイプ";
$ary[1704100] = "";
$ary[1704110] = "配列変数";
$ary[1704120] = "";
$ary[1704130] = "メンバー変数";
$ary[1704140] = "";
$ary[1704150] = "代入順序";
$ary[1704160] = "";
$ary[1704170] = "列順序";
$ary[1704180] = "";
$ary[1704190] = "具体値";
$ary[1704200] = "";
$ary[1705010] = "Ansible-Legacy Roleの多段変数最大繰返数をメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1705020] = "項番";
$ary[1705030] = "Ansible(Legacy Role)多段変数最大繰返数";
$ary[1705040] = "Ansible(Legacy Role)多段変数最大繰返数";
$ary[1705050] = "変数名";
$ary[1705060] = "";
$ary[1705070] = "メンバー変数名（繰返し有）";
$ary[1705080] = "";
$ary[1705090] = "最大繰返数";
$ary[1705100] = "";
$ary[1706010] = "Ansible-Legacy Roleの多段変数メンバーをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1706020] = "項番";
$ary[1706030] = "Ansible（Legacy Role）多段変数メンバー管理";
$ary[1706040] = "Ansible（Legacy Role）多段変数メンバー管理";
$ary[1706050] = "変数名";
$ary[1706060] = "";
$ary[1706070] = "親メンバー変数へのキー";
$ary[1706080] = "";
$ary[1706090] = "自メンバー変数のキー";
$ary[1706100] = "";
$ary[1706110] = "メンバー変数名";
$ary[1706120] = "";
$ary[1706130] = "階層";
$ary[1706140] = "";
$ary[1706150] = "代入順序有無";
$ary[1706160] = "";
$ary[1706170] = "列順序有無";
$ary[1706180] = "";
$ary[1706190] = "代入値管理系の表示有無";
$ary[1706200] = "";
$ary[1706210] = "最大繰返数";
$ary[1706220] = "";
$ary[1706230] = "メンバー変数の階層パス";
$ary[1706240] = "";
$ary[1706250] = "代入値管理系の表示メンバー変数名";
$ary[1706260] = "";
$ary[1707010] = "Ansible-Legacy Roleの多段変数配列組合せをメンテナンス(閲覧/登録/更新/廃止)できます。 ";
$ary[1707020] = "項番";
$ary[1707030] = "Ansible（Legacy Role）多段変数配列組合せ";
$ary[1707040] = "Ansible（Legacy Role）多段変数配列組合せ";
$ary[1707050] = "変数名";
$ary[1707060] = "";
$ary[1707070] = "多段変数項番";
$ary[1707080] = "";
$ary[1707090] = "プルダウン表示メンバー変数";
$ary[1707100] = "";
$ary[1707110] = "すべての列順序";
$ary[1707120] = "";
$ary[1800000] = "Playbookで使用するファイルをメンテナンス(閲覧/登録/更新/廃止)できます。 <br><br>ファイル埋込変数名には CPF_ で始まる変数名を入力して下さい。<br>この変数名をPlaybookに記述します。<br>(例)<br>　　　- copy: src={{ CPF_sample }} dest=/usr/local/src<br>　　　- unarchive src={{ CPF_sample }} dest=/usr/local/bin remote_src=yes<br>";
$ary[1800001] = "素材ID";
$ary[1800002] = "Ansible ファイル管理";
$ary[1800003] = "Ansible ファイル管理";
$ary[1800010] = "ファイル埋込変数名";
$ary[1800011] = "接頭文字として必ず「CPF_」を付与して下さい。";
$ary[1800020] = "ファイル素材";
$ary[1800021] = "Playbookで使用するファイルを指定して下さい。";
$ary[1900000] = "紐付対象メニューに登録されているオぺーションとホスト毎の項目の設定値を紐付けるMovementと変数がメンテナンス(閲覧/登録/更新/廃止)できます。<br><br>項目の設定値の登録方法には3種類あります。<br>Value型:項目の設定値を紐付けた変数の具体値として代入値管理に登録されます。<br>Key-Value型:項目の名称(Key)と設定値(Value)を紐付けた変数の具体値として代入値管理に登録されます。<br>Key型:項目の名称を紐付けた変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1900001] = "項番";
$ary[1900002] = "Ansible（Legacy Role）代入値自動登録設定";
$ary[1900003] = "Ansible（Legacy Role）代入値自動登録設定";
$ary[1900004] = "メニューグループ";
$ary[1900005] = "ID";
$ary[1900006] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1900007] = "名称";
$ary[1900008] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1900009] = "メニュー";
$ary[1900010] = "ID";
$ary[1900011] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1900012] = "名称";
$ary[1900013] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1900100] = "メニューグループ:メニュー";
$ary[1900101] = "[元データ]紐付対象メニュー";
$ary[1900120] = "項目";
$ary[1900121] = "[元データ]紐付対象メニューの項目";
$ary[1900125] = "メニューグループ:メニュー:項目";
$ary[1900126] = "[元データ]紐付対象メニューの項目";
$ary[1900130] = "登録方式";
$ary[1900131] = "Value型:紐付対象メニューの項目の設定値を紐付けたValue型変数の具体値として代入値管理に登録されます。\nKey-Value型:紐付対象メニューの項目の名称(Key)と設定値(Value)を紐付けた各変数の具体値として代入値管理に登録されます。\nKey型:紐付対象メニューの項目の名称を紐付けたKey変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1900140] = "Movement";
$ary[1900141] = "[元データ]Movement一覧";
$ary[1900150] = "Value変数";
$ary[1900160] = "変数名";
$ary[1900161] = "Role内のPlaybook、テンプレート、及びデフォルト定義ファイルから自動取得。項目に紐付ける変数を設定します。\n項目の設定値が変数の具体値なります。";
$ary[1900162] = "Movementを選択して下さい";
$ary[1900170] = "メンバー変数名";
$ary[1900171] = "変数名で配列変数を指定した場合は入力必須。その他の場合は入力不可。";
$ary[1900180] = "入力不要";
$ary[1900181] = "入力不要";
$ary[1900182] = "変数名を選択して下さい";
$ary[1900190] = "列順序";
$ary[1900191] = "変数名で配列変数を指定した場合は正の整数を入力。一般変数の場合は入力不可。";
$ary[1900200] = "代入順序";
$ary[1900201] = "変数名で配列変数を指定した場合は入力不可。\nその他の場合は正の整数を入力。入力値が昇順で代入されます。\n具体値が複数ない場合でも正の整数を入力して下さい。";
$ary[1900210] = "Key変数";
$ary[1900220] = "変数名";
$ary[1900221] = "Role内のPlaybook、テンプレート、及びデフォルト定義ファイルから自動取得。項目に紐付ける変数を設定します。\n項目の名称が変数の具体値なります。";
$ary[1900222] = "Movementを選択して下さい";
$ary[1900230] = "メンバー変数名";
$ary[1900231] = "変数名で配列変数を指定した場合は入力必須。その他の場合は入力不可。";
$ary[1900240] = "入力不要";
$ary[1900241] = "入力不要";
$ary[1900242] = "変数名を選択して下さい";
$ary[1900250] = "列順序";
$ary[1900251] = "変数名で配列変数を指定した場合は入力必須。その他の場合は入力不可。";
$ary[1900260] = "代入順序";
$ary[1900261] = "変数名で配列変数を指定した場合は入力不可。\nその他の場合は正の整数を入力。入力値が昇順で代入されます。\n具体値が複数ない場合でも正の整数を入力して下さい。";
$ary[1900262] = "メニューを選択して下さい";
$ary[1900301] = "パラメータシート";
$ary[1900302] = "IaC変数";
$ary[1901000] = "紐付対象メニューに登録されているオぺーションとホスト毎の項目の設定値を紐付けるMovementと変数がメンテナンス(閲覧/登録/更新/廃止)できます。<br><br>項目の設定値の登録方法には3種類あります。<br>Value型:項目の設定値を紐付けた変数の具体値として代入値管理に登録されます。<br>Key-Value型:項目の名称(Key)と設定値(Value)を紐付けた変数の具体値として代入値管理に登録されます。<br>Key型:項目の名称を紐付けた変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1901001] = "項番";
$ary[1901002] = "Ansible（Legacy）代入値自動登録設定";
$ary[1901003] = "Ansible（Legacy）代入値自動登録設定";
$ary[1901004] = "メニューグループ";
$ary[1901005] = "ID";
$ary[1901006] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1901007] = "名称";
$ary[1901008] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1901009] = "メニュー";
$ary[1901010] = "ID";
$ary[1901011] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1901012] = "名称";
$ary[1901013] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1901100] = "メニューグループ:メニュー";
$ary[1901101] = "[元データ]紐付対象メニュー";
$ary[1901120] = "項目";
$ary[1901121] = "[元データ]紐付対象メニューの項目";
$ary[1901130] = "登録方式";
$ary[1901131] = "Value型:紐付対象メニューの項目の設定値を紐付けたValue型変数の具体値として代入値管理に登録されます。\nKey-Value型:紐付対象メニューの項目の名称(Key)と設定値(Value)を紐付けた各変数の具体値として代入値管理に登録されます。\nKey型:紐付対象メニューの項目の名称を紐付けたKey変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1901140] = "Movement";
$ary[1901141] = "[元データ]Movement一覧";
$ary[1901150] = "Value変数";
$ary[1901160] = "変数名";
$ary[1901161] = "Playbook、テンプレートから自動取得\n項目に紐付ける変数を設定します。\n項目の設定値が変数の具体値なります。";
$ary[1901162] = "Movementを選択して下さい";
$ary[1901200] = "代入順序";
$ary[1901201] = "ブランクまたは正の整数\n記載あり:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入値が昇順で代入されたのちブランクの代入が値代入される";
$ary[1901210] = "Key変数";
$ary[1901220] = "変数名";
$ary[1901221] = "Playbook、テンプレートから自動取得\n項目に紐付ける変数を設定します。\n項目の名称が変数の具体値なります。";
$ary[1901222] = "Movementを選択して下さい";
$ary[1901260] = "代入順序";
$ary[1901261] = "ブランクまたは正の整数\n記載あり:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入値が昇順で代入されたのちブランクの代入が値代入される";
$ary[1901262] = "メニューを選択して下さい";
$ary[1901301] = "パラメータシート";
$ary[1901302] = "IaC変数";
$ary[1902000] = "紐付対象メニューに登録されているオぺーションとホスト毎の項目の設定値を紐付けるMovementと変数がメンテナンス(閲覧/登録/更新/廃止)できます。<br><br>項目の設定値の登録方法には3種類あります。<br>Value型:項目の設定値を紐付けた変数の具体値として代入値管理に登録されます。<br>Key-Value型:項目の名称(Key)と設定値(Value)を紐付けた変数の具体値として代入値管理に登録されます。<br>Key型:項目の名称を紐付けた変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1902001] = "項番";
$ary[1902002] = "Ansible（Pioneer）代入値自動登録設定";
$ary[1902003] = "Ansible（Pioneer）代入値自動登録設定";
$ary[1902004] = "メニューグループ";
$ary[1902005] = "ID";
$ary[1902006] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1902007] = "名称";
$ary[1902008] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1902009] = "メニュー";
$ary[1902010] = "ID";
$ary[1902011] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1902012] = "名称";
$ary[1902013] = "登録・更新時は当該項目は更新対象ではない。";
$ary[1902100] = "メニューグループ:メニュー";
$ary[1902101] = "[元データ]紐付対象メニュー";
$ary[1902120] = "項目";
$ary[1902121] = "[元データ]紐付対象メニューの項目";
$ary[1902125] = "メニューグループ:メニュー:項目";
$ary[1902126] = "[元データ]紐付対象メニューの項目";
$ary[1902130] = "登録方式";
$ary[1902131] = "Value型:紐付対象メニューの項目の設定値を紐付けたValue型変数の具体値として代入値管理に登録されます。\nKey-Value型:紐付対象メニューの項目の名称(Key)と設定値(Value)を紐付けた各変数の具体値として代入値管理に登録されます。\nKey型:紐付対象メニューの項目の名称を紐付けたKey変数の具体値として代入値管理に登録されます。項目の設定値が空白の場合に代入値管理に登録されません";
$ary[1902140] = "Movement";
$ary[1902141] = "[元データ]Movement一覧";
$ary[1902150] = "Key変数";
$ary[1902152] = "代入順序";
$ary[1902153] = "ブランクまたは正の整数\n記載あ り:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入 値が昇順で代入されたのちブランクの代入が値代入される";
$ary[1902155] = "Value変数";
$ary[1902157] = "代入順序";
$ary[1902158] = "ブランクまたは正の整数\n記載あ り:昇順で代入される\nブランク:単一の代入値として代入される\n混在:記載ありの代入 値が昇順で代入されたのちブランクの代入が値代入される";
$ary[1902160] = "Value変数";
$ary[1902161] = "対話ファイルから自動取得\n項目に紐付ける変数を設定します。\n項目の設定値が変数の具体値なります。";
$ary[1902162] = "Movementを選択して下さい";
$ary[1902220] = "Key変数";
$ary[1902221] = "対話ファイルから自動取得\n項目に紐付ける変数を設定します。\n項目の名称が変数の具体値なります。";
$ary[1902222] = "Movementを選択して下さい";
$ary[1902262] = "メニューを選択して下さい";
$ary[1902301] = "パラメータシート";
$ary[1902302] = "IaC変数";
$ary[1910000] = "代入値自動登録設定に紐付けるメニューをメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[1910001] = "項番";
$ary[1910002] = "Ansible紐付対象メニュー";
$ary[1910003] = "Ansible紐付対象メニュー";
$ary[1910004] = "メニューグループ";
$ary[1910005] = "ID";
$ary[1910006] = "登録・更新時は当該項目は更新対象ではない。(メニューIDを更新すること)";
$ary[1910007] = "名称";
$ary[1910008] = "登録・更新時は当該項目は更新対象ではない。(メニューIDを更新すること)";
$ary[1910009] = "メニュー";
$ary[1910010] = "ID";
$ary[1910011] = "登録・更新時は当該項目は更新対象ではない。(メニューグループ:メニューを更新すること)";
$ary[1910012] = "名称";
$ary[1910013] = "登録・更新時は当該項目は更新対象ではない。(メニューグループ:メニューを更新すること)";
$ary[1910014] = "メニューグループ:メニュー";
$ary[1920000] = "紐付対象メニューカラム管理";
$ary[1920001] = "項番";
$ary[1920002] = "Ansible紐付対象メニューカラム情報";
$ary[1920003] = "Ansible紐付対象メニューカラム情報";
$ary[1920004] = "メニュー";
$ary[1920005] = "カラム";
$ary[1920006] = "項目名";
$ary[1930000] = "紐付対象メニューテーブル管理";
$ary[1930001] = "項番";
$ary[1930002] = "Ansible紐付対象メニューテーブル情報";
$ary[1930003] = "Ansible紐付対象メニューテーブル情報";
$ary[1930004] = "メニュー";
$ary[1930005] = "テーブル名";
$ary[1940000] = "Playbookや対話ファイルで使用するグローバル変数をメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[1940001] = "項番";
$ary[1940002] = "Ansibleグローバル変数管理";
$ary[1940003] = "Ansible グローバル変数管理";
$ary[1940010] = "グローバル変数名";
$ary[1940011] = "接頭文字として必ず「GBL_」を付与して下さい。";
$ary[1940020] = "具体値";
$ary[1940021] = "[最大長]1024バイト";
$ary[1940030] = "変数名説明";
$ary[1940031] = "[最大長]256バイト";
$ary[1950000] = "Playbookで使用するファイルをメンテナンス(閲覧/登録/更新/廃止)できます。 <br><br>ファイル埋込変数名には CPF_ で始まる変数名を入力して下さい。<br>この変数名をPlaybookに記述します。<br>(例)<br>　　　- copy: src={{ CPF_sample }} dest=/usr/local/src<br>　　　- unarchive src={{ CPF_sample }} dest=/usr/local/bin remote_src=yes<br>";
$ary[1950001] = "素材ID";
$ary[1950002] = "Ansible(Legacy Role)ファイル管理";
$ary[1950003] = "Ansible(Legacy Role)ファイル管理";
$ary[1950010] = "ファイル埋込変数名";
$ary[1950011] = "接頭文字として必ず「CPF_」を付与して下さい。";
$ary[1950020] = "ファイル素材";
$ary[1950021] = "copyモジュールで使用するファイルを指定して下さい。";
$ary[1960001] = "対話ファイルで使用するファイルをメンテナンス(閲覧/登録/更新/廃止)できます。 <br><br>ファイル埋込変数名には CPF_ で始まる変数名を入力して下さい。<br>この変数名を対話ファイルに記述します。<br>";
$ary[1960002] = "素材ID";
$ary[1960003] = "Ansible(Pioneer)ファイル管理";
$ary[1960004] = "Ansible(Pioneer)ファイル管理";
$ary[1960005] = "ファイル埋込変数名";
$ary[1960006] = "接頭文字として必ず「CPF_」を付与して下さい。";
$ary[1960007] = "ファイル素材";
$ary[1960008] = "配布するファイルを指定して下さい。";
$ary[1970001] = "Ansibleのtemplateモジュールで使用するテンプレートファイルをメンテナンス(閲覧/登録/更新/廃止)できます。 <br><br>テンプレートファイル内の変数には接頭文字として「VAR_」を付与して下さい。<br>接頭文字が「VAR_」の変数が、代入値管理メニューにて選択可能になります。<br>(例) {{ VAR_OMCS }}";
$ary[1970002] = "素材ID";
$ary[1970003] = "Ansible(Pioneer)テンプレート";
$ary[1970004] = "Ansible(Pioneer)テンプレート";
$ary[1970005] = "(接頭文字TPF_)半角英数字と利用可能な記号（_）";
$ary[1970006] = "テンプレート埋込変数名";
$ary[1970007] = "接頭文字として必ず「TPF_」を付与して下さい。";
$ary[1970008] = "テンプレート素材";
$ary[1970009] = "テンプレートとして使用できるのは、テキスト形式のファイルに限られます。\n(Ansible仕様)";
$ary[1970010] = "表示順序";
$ary[1970011] = "表示順序の制御用";
$ary[2000000] = "実行ログ";
$ary[2000001] = "エラーログ";
$ary[5000000] = "Ansible Roleで使用出来る読替変数をメンテナンス(閲覧/登録/更新/廃止)できます。";
$ary[5000001] = "項番";
$ary[5000002] = "Ansible Role 読替変数一覧";
$ary[5000003] = "Ansible Role 読替変数一覧";
$ary[5000100] = "ロールパッケージ";
$ary[5000101] = "";
$ary[5000200] = "ロール";
$ary[5000201] = "";
$ary[5000300] = "読替変数";
$ary[5000301] = "";
$ary[5000400] = "任意変数";
$ary[5000401] = "";
$ary[5010000] = "作業対象ホスト";
$ary[5010001] = "確認";
$ary[5010002] = "代入値";
$ary[5010003] = "確認";
$ary[6000000] = "NULL連携";
$ary[6000001] = "パラメータシートの具体値がNULL(空白)の場合、代入値管理への登録を有効にするかを設定します。\n空白:Ansible共通インターフェース情報のNULL連携に従う。\n有効:NULLデータを登録する。\n無効:NULLデータは登録しない。";
$ary[6000002] = "代入値自動登録設定でパラメータシートの具体値がNULL(空白)の場合に、代入値管理への登録を有効にするかのデフォルトを設定します。\n有効:NULLデータを登録する。\n無効:NULLデータは登録しない。";
$ary[907350509] = "Ansible Towerに作成される一時オブジェクトを削除するかを選択します。";
$ary[907390509] = "実行時データ削除";
$ary[907342701] = "AnsibleTower インスタンスグループリスト";
$ary[907352702] = "インスタンスグループ名";
$ary[907352703] = "AnsibleTowerで設定されているインスタンスグループIDです。";
$ary[907362701] = "AnsibleTower インスタンスグループリスト";
$ary[907392701] = "項番";
$ary[907392702] = "インスタンスグループ名";
$ary[907392703] = "インスタンスグループID";
$ary[9010000000] = "認証トークン";
$ary[9010000001] = "ITAからRestAPIでAnsible Towerに接続するユーザーの認証トークンです。";
$ary[9010000002] = "組織名";
$ary[9010000003] = "Ansible Towerに登録されている組織名を入力します。";
$ary[9010000004] = "Ansible core インターフェース";
$ary[9010000005] = "Tower インターフェース";
$ary[9010000006] = "Legacy";
$ary[9010000007] = "Legacy Role";
$ary[9010000008] = "ヘッダーセクション";
$ary[9010000009] = "ITAが自動生成する親Playbookの先頭からtasksセクションまでのセクションを編集します。
未入力の場合は、以下を適用します。
Ansible:
  - hosts: all
    remote_user: \"{{ __loginuser__ }}\"
    gather_facts: no
    become: yes

Ansible Tower:
  - hosts: all
    gather_facts: no
    become: yes
winrm接続の場合は「become: yes」は省略されます。";
$ary[9010000010] = "オプションパラメータ";
$ary[9010000011] = "Movement固有のansible-playbookコマンドのオプションパラメータを設定します。
Movement共通のオプションパラメータはインターフェース情報で設定にします。
Ansible:
  ansible-playbookコマンドのパラメータを設定します。
　-i オプションはITAが設定します。

Ansible Tower:
　以下のパラメータが設定できます。
　　-verbosity
　　-f FORKS,--forks=FORKS
　　-l SUBSET,--limit=SUBSET
　　-e EXTRA_VARS,--extra-vars=EXTRA_VARS
        EXTRA_VARS:  変数名=具体値 変数名=具体値 .....
　　-t TAGS,--tags=TAGS
　　-b,--become
　　-D,--diff
　　--skip-tags=SKIP_TAGS
　　--start-at-task=START_AT_TASK
　以下はAnsible Tower独自のパラメータです。
　　-ufc,--use_fact_cache　　　ファクトのキャッシュの使用
　　-as,--allow_simultaneous　 同時実行ジョブの有効化
　　-jsc,--job_slice_count=　　JOB SLICING
　詳細はAnsible利用手順マニュアルを参照して下さい。";
$ary[9010000012] = "ITAが自動生成する親Playbookの先頭からrolesセクションまでのセクションを編集します。
未入力の場合は、以下を適用します。
Ansible:
  - hosts: all
    remote_user: \"{{ __loginuser__ }}\"
    gather_facts: no
    become: yes

Ansible Tower:
  - hosts: all
    gather_facts: no
    become: yes
winrm接続の場合は「become: yes」は省略されます。";
$ary[9010000013] = "Tower利用情報";
$ary[9010000014] = "virtualenv";
$ary[9010000015] = "virtualenvで構築されているansible実行環境をディレクトリで表示しています。\n実行したいansible実行環境を選択します。\n未選択の場合はTowerインストール時にインストールされたansible実行環境を使用します。";
$ary[9010000016] = "virtualenv";
$ary[9010000017] = "virtualenvで構築されているansible実行環境をディレクトリで表示しています。";
?>