<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITACREPAR_STD
$ary["ITACREPAR_1001"]       = "メニューが作成されていません";
$ary["ITACREPAR_1101"]       = "メニューが作成されていません";
$ary["ITACREPAR_1201"]       = "メニュー作成を実行しますか？\n※既に同じメニュー名のメニューや「メニュー定義一覧」メニューの項番が同じメニューが存在する場合、上書きでメニューが作成され、入力済みのデータは削除されます。\n入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary["ITACREPAR_1202"]       = "項目";
$ary["ITACREPAR_1203"]       = "グループ";
$ary["ITACREPAR_1204"]       = "文字列(単一行)";
$ary["ITACREPAR_1205"]       = "文字列(複数行)";
$ary["ITACREPAR_1206"]       = "整数";
$ary["ITACREPAR_1207"]       = "小数";
$ary["ITACREPAR_1208"]       = "日時";
$ary["ITACREPAR_1209"]       = "日付";
$ary["ITACREPAR_1210"]       = "プルダウン選択";
$ary["ITACREPAR_1211"]       = "項番";
$ary["ITACREPAR_1212"]       = "自動入力";
$ary["ITACREPAR_1213"]       = "最大バイト数";
$ary["ITACREPAR_1214"]       = "正規表現";
$ary["ITACREPAR_1215"]       = "最小値";
$ary["ITACREPAR_1216"]       = "最大値";
$ary["ITACREPAR_1217"]       = "桁数";
$ary["ITACREPAR_1218"]       = "選択項目";
$ary["ITACREPAR_1219"]       = "必須";
$ary["ITACREPAR_1220"]       = "一意制約";
$ary["ITACREPAR_1221"]       = "説明";
$ary["ITACREPAR_1222"]       = "備考";
$ary["ITACREPAR_1223"]       = "ホスト名";
$ary["ITACREPAR_1224"]       = "オペレーション";
$ary["ITACREPAR_1225"]       = "パラメータ";
$ary["ITACREPAR_1226"]       = "オペレーション名";
$ary["ITACREPAR_1227"]       = "基準日時";
$ary["ITACREPAR_1228"]       = "実施予定日";
$ary["ITACREPAR_1229"]       = "最終実行日時";
$ary["ITACREPAR_1230"]       = "備考";
$ary["ITACREPAR_1231"]       = "最終更新日時";
$ary["ITACREPAR_1232"]       = "最終更新者";
$ary["ITACREPAR_1233"]       = "オペレーション";
$ary["ITACREPAR_1234"]       = "システム管理者";
$ary["ITACREPAR_1235"]       = "対象メニューグループ";
$ary["ITACREPAR_1236"]       = "メニュー作成を受付ました。\nメニュー作成履歴ボタンを押して、メニュー作成状況を確認してください。\n項番：";
$ary["ITACREPAR_1237"]       = "パスワード";
$ary["ITACREPAR_1238"]       = "リピートが解除されます。";
$ary["ITACREPAR_1239"]       = "リピートを含む項目はコピーできません。";
$ary["ITACREPAR_1240"]       = "入力用";
$ary["ITACREPAR_1241"]       = "代入値<br>自動登録用";
$ary["ITACREPAR_1242"]       = "参照用";
$ary["ITACREPAR_1243"]       = "メニューグループ名称";
$ary["ITACREPAR_1244"]       = "縦メニューについて";
$ary["ITACREPAR_1245"]       = "利用する";
$ary["ITACREPAR_1246"]       = "ファイル最大バイト数";
$ary["ITACREPAR_1247"]       = "ファイル";
$ary["ITACREPAR_1248"]       = "リンク";
$ary["ITACREPAR_1249"]       = "メニューの編集を実行しますか？\n※既存の項目に入力されているデータは残りますが、既存の項目を削除していた場合、その項目に入力されていたデータは削除されます。\n既存の項目で「正規表現」を変更した場合、既存のデータと不整合が発生する可能性があります。\nまた、新たに追加した項目を「必須」や「一意制約」としていた場合、必須項目に空のデータが入り、データの不整合が発生する可能性があります。\n修正が必要な場合は「キャンセル」を選択してください。";
$ary["ITACREPAR_1250"]       = "メニューの初期化を実行しますか？\n※このメニューの入力済みのデータは削除されます。\n入力済みのデータが必要な場合は、「キャンセル」を選択して、データをバックアップしてください。";
$ary["ITACREPAR_1251"]       = "参照可能な項目がありません";
$ary["ITACREPAR_1252"]       = "参照項目";
$ary["ITACREPAR_1253"]       = "[参照した値]";
$ary["ITACREPAR_1254"]       = "参照項目を選択";
$ary["ITACREPAR_1255"]       = "ID変換失敗({})";
$ary["ITACREPAR_1256"]       = "項目の名称を入力します。[最大長]256バイト\n※項目名に「/」は使用禁止です。\n※「リピート枠内で使用した名称[数字]」は、リピート枠外の項目名には使用できません。";
$ary["ITACREPAR_1257"]       = "項目を移動します。";
$ary["ITACREPAR_1258"]       = "項目を削除します。";
$ary["ITACREPAR_1259"]       = "項目をコピーします。";
$ary["ITACREPAR_1260"]       = "リピート数を入力します。\n※2～99の整数が入力できます。";
$ary["ITACREPAR_1261"]       = "入力方式をプルダウンメニューの「文字列(単一行)」、「文字列(複数行)」、\n「整数」、「小数」、「日時」、「日付」、「プルダウン選択」、「パスワード」、\n「ファイルアップロード」、「リンク」、「パラメータ参照」のいずれかから選択します。";
$ary["ITACREPAR_1262"]       = "最大バイト数を入力します。[最大長]8192バイト\n編集の場合、元の値より増加させることは可能です。\n※半角英数字なら文字数分となります。\n※全角文字ならば文字数×3＋2 バイト必要になります。";
$ary["ITACREPAR_1263"]       = "正規表現による入力値チェックを行う場合は、正規表現を入力します。[最大長]8192バイト\n例：0バイト以上の半角数値項目の場合：/^[0-9]*$/\n　　1バイト以上の半角英数字の場合：/^[a-zA-Z0-9]+$/";
$ary["ITACREPAR_1264"]       = "最小値を入力します。\n編集の場合、元の値より減少させることは可能です。\n※-2147483648～2147483647 の整数数値が入力できます。\n※未入力の場合は-2147483648 になります。\n※最小値は最大値より小さい数値を入力してください。";
$ary["ITACREPAR_1265"]       = "最大値を入力します。\n編集の場合、元の値より増加させることは可能です。\n※-2147483648～2147483647 の整数数値が入力できます。\n※未入力の場合は 2147483647 になります。\n※最大値は最小値より大きい数値を入力してください。";
$ary["ITACREPAR_1266"]       = "最小値を入力します。\n編集の場合、元の値より減少させることは可能です。\n※-99999999999999～99999999999999、整数・小数合計 14 桁以下の小数数値が入力できます。\n※未入力の場合は-99999999999999 になります。\n※最小値は最大値より小さい数値を入力してください。";
$ary["ITACREPAR_1267"]       = "最大値を入力します。\n編集の場合、元の値より増加させることは可能です。\n※-99999999999999～99999999999999、整数・小数合計 14 桁以下の小数数値が入力できます。\n※未入力の場合は 99999999999999 になります。\n※最大値は最小値より大きい数値を入力してください。";
$ary["ITACREPAR_1268"]       = "整数・小数の合計桁数上限を入力します。\n編集の場合、元の値より増加させることは可能です。\n例：0.123は4桁(整数1桁、小数3桁)\n　　11.1111は6桁(整数2桁、小数4桁)\n※1～14の整数数値が入力できます。\n※未入力の場合は14になります。";
$ary["ITACREPAR_1269"]       = "作成したメニュー(パラメータシート/データシート)から参照する対象をプルダウンから選択します。\n「選択項目」欄の文字列は「メニューグループ：メニュー：項目」の構成です。";
$ary["ITACREPAR_1270"]       = "アップロードするファイルの最大バイト数を入力します。\n編集の場合、元の値より増加させることは可能です。\n最大は4294967296バイトです。";
$ary["ITACREPAR_1271"]       = "必須項目にする場合は、チェックボックスを選択します。";
$ary["ITACREPAR_1272"]       = "一意制約項目にする場合は、チェックボックスを選択します。";
$ary["ITACREPAR_1273"]       = "項目名をマウスオーバーした際に表示される説明を入力します。[最大長]1024バイト";
$ary["ITACREPAR_1274"]       = "備考を入力します。[最大長]8192バイト";
$ary["ITACREPAR_1275"]       = "「プルダウン選択」で選んだメニュー項目を元に、ほかの項目を参照します。";
$ary["ITACREPAR_1276"]       = "作成";
$ary["ITACREPAR_1277"]       = "未作成";
$ary["ITACREPAR_1278"]       = "作成済み";
$ary["ITACREPAR_1279"]       = "参照項目の取得に失敗しました。";
$ary["ITACREPAR_1280"]       = "一意制約(複数項目)";
$ary["ITACREPAR_1281"]       = "項目が一つもありません";
$ary["ITACREPAR_1282"]       = "削除";
$ary["ITACREPAR_1283"]       = "パターンを追加";
$ary["ITACREPAR_1284"]       = "パターンが一つもありません。";
$ary["ITACREPAR_1285"]       = "アクセス許可ロール";
$ary["ITACREPAR_1286"]       = "参照項目";
$ary["ITACREPAR_1287"]       = "初期値";
$ary["ITACREPAR_1288"]       = "初期値の取得に失敗しました。";
$ary["ITACREPAR_1289"]       = "作成したメニューから登録する際、デフォルトで入力欄に入る値を設定します。\n「最大バイト数」を超える値、「正規表現」に不一致な値は設定できません。";
$ary["ITACREPAR_1290"]       = "作成したメニューから登録する際、デフォルトで入力欄に入る値を設定します。\n「最大値」「最小値」の範囲外の値は設定できません。";
$ary["ITACREPAR_1291"]       = "作成したメニューから登録する際、デフォルトで入力欄に入る値を設定します。\n「最大値」「最小値」「桁数」の範囲外の値は設定できません。";
$ary["ITACREPAR_1292"]       = "作成したメニューから登録する際、デフォルトで入力欄に入る値を設定します。";
$ary["ITACREPAR_1293"]       = "作成したメニューから登録する際、デフォルトで入力欄に入る値を設定します。\n「最大バイト数」を超える値は設定できません。";
$ary["ITACREPAR_1294"]       = "作成したメニューから登録する際、デフォルトで選択される値を設定します。";
$ary["ITACREPAR_1295"]       = "Please Wait... Loading";
$ary["ITACREPAR_1296"]       = "メニュー";
$ary["ITACREPAR_1297"]       = "項目";
$ary["ITACREPAR_1298"]       = "[参照した値]";
$ary["ITACREPAR_1299"]       = "作成対象「パラメータシート(オペレーションあり)」で作成したメニューの項目の中から参照する項目を選択します。\n選択した項目の中から同一オペレーションの値を参照します。";
$ary["ITACREPAR_1300"]       = "項目の取得に失敗しました。";
?>