<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITACREPAR_ERR
$ary[1001] = "「メインメニュー」は設定できません。";
$ary[1002] = "「ホスト用」を設定した場合、「ホストグループ用メニューグループ」は設定できません。";
$ary[1003] = "ホストグループ機能がインストールされていないため、「ホストグループ用」は設定できません。";
$ary[1004] = "「ホストグループ用」を設定した場合、「ホストグループ用メニューグループ」は必須です。";
$ary[1005] = "他のメニューグループと同じ値は設定できません。";
$ary[1006] = "以下の計算式に当てはまるように設定してください。\n同一メニュー名のサイズ(「最大バイト数」 * 3 + 2)の合計　≦　53460";
$ary[1007] = "パラメータシート項目作成情報テーブルの検索に失敗しました。SQLエラー=[{}]";
$ary[1008] = "実施予定日はYYYY/MM/DD形式で有効な日付を入力してください。";
$ary[1009] = "「文字列」を設定した場合、「最大バイト数」は必須です。";
$ary[1010] = "「文字列」を設定した場合、「メニューグループ：メニュー：項目」は設定できません。";
$ary[1011] = "「他メニュー参照」を設定した場合、「最大バイト数」は設定できません。";
$ary[1012] = "「他メニュー参照」を設定した場合、「正規表現」は設定できません。";
$ary[1013] = "「他メニュー参照」を設定した場合、「メニューグループ：メニュー：項目」は必須です。";
$ary[1014] = "自分のカラムグループは親カラムグループに選択できません。";
$ary[1015] = "ループ関係になるため選択不可です。";
$ary[1016] = "カラムグループ管理の検索に失敗しました。SQLエラー=[{}]";
$ary[1017] = "親カラムグループに選択されているため廃止できません。子カラムグループの項番=[{}]";
$ary[1018] = "「/」の文字は使用できません。";
$ary[1019] = "同一のメニューの項目は登録できません。項番=[{}]";
$ary[1020] = "「\/:*?\"<>|[]：￥／＊［］」の文字は使用できません。";
$ary[1021] = "PHP関数preg_matchの第1引数の形式で入力してください。";
$ary[5001] = "ファイルが存在しません。.ファイル=[{}]";
$ary[5002] = "ファイルの読込に失敗しました。.ファイル=[{}]";
$ary[5003] = "SQLの実行が失敗しました。SQLエラー=[{}]";
$ary[5004] = "ディレクトリの作成が失敗しました。ディレクトリ=[{}]";
$ary[5005] = "パラメータシート作成情報が取得できませんでした。";
$ary[5006] = "パラメータシート項目作成情報が取得できませんでした。";
$ary[5007] = "ファイルの作成が失敗しました。ファイル=[{}]";
$ary[5008] = "ZIPファイルへのファイル追加で失敗しました。ZIPファイル=[{}]、追加ファイル=[{}]";
$ary[5009] = "ディレクトリの削除が失敗しました。ディレクトリ=[{}]";
$ary[5010] = "ファイルのコピーに失敗しました。コピー元=[{}]、コピー先=[{}]";
$ary[5011] = "パラメータ項目作成情報のカラムグループが特定できませんでした。項番=[{}]";
$ary[5012] = "マスタ作成情報が取得できませんでした。";
$ary[5013] = "マスタ項目作成情報が取得できませんでした。";
$ary[5014] = "パラメータシート(縦)作成情報が取得できませんでした。";
$ary[5015] = "パラメータシート(縦)作成情報の項目数と繰り返し数が不正です。";
$ary[5016] = "パラメータシート(縦)作成情報の設定による繰り返し項目で、入力方式が一致しません。";
$ary[5017] = "パラメータシート(縦)作成情報の設定による繰り返し項目で、最大バイト数が一致しません。";
$ary[5018] = "パラメータシート(縦)作成情報の設定による繰り返し項目で、他メニュー参照のメニューグループ：メニュー：項目名が一致しません。";
?>