<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITAHOSTGROUP_MNU
$ary[100001] = "ホストグループ一覧";
$ary[100002] = "ホストグループID";
$ary[100003] = "ホストグループ一覧";
$ary[100004] = "ホストグループ一覧";
$ary[100005] = "ホストグループ名";
$ary[100006] = "シングルラインテキスト入力。128byte制限。";
$ary[100007] = "優先順位(大きい方が強い)";
$ary[100008] = "ホストグループが同列になった時の優先順位(大きい方が強い)です。";
$ary[100101] = "ホストグループ親子紐付";
$ary[100102] = "項番";
$ary[100103] = "ホストグループ親子紐付";
$ary[100104] = "ホストグループ親子紐付";
$ary[100105] = "ループアラーム";
$ary[100106] = "ホストグループとホストの関係からループが発生している場合は●が付与されます。";
$ary[100107] = "ホストグループ";
$ary[100108] = "親";
$ary[100109] = "プルダウン。NotNull。ユニーク制約なし。";
$ary[100110] = "子";
$ary[100111] = "プルダウン。NotNull。ユニーク制約なし。";
$ary[100201] = "ホスト紐付管理";
$ary[100202] = "項番";
$ary[100203] = "ホスト紐付管理";
$ary[100204] = "ホスト紐付管理";
$ary[100205] = "ホストグループ名";
$ary[100206] = "プルダウン入力。NotNull制約あり。ユニーク制約なし。";
$ary[100207] = "オペレーション";
$ary[100208] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[100209] = "ホスト名";
$ary[100210] = "プルダウン入力。NotNull制約あり。ユニーク制約なし。";
$ary[100301] = "ホストグループ変数化";
$ary[100302] = "項番";
$ary[100303] = "ホストグループ変数化";
$ary[100304] = "ホストグループ変数化";
$ary[100305] = "ホストグループ名";
$ary[100306] = "プルダウン入力。NotNull制約あり。ユニーク制約なし。";
$ary[100307] = "ホストグループ変数名";
$ary[100308] = "シングルラインテキスト入力。128byte制限。";
$ary[100309] = "ホスト名";
$ary[100310] = "プルダウン入力。NotNull制約あり。ユニーク制約なし。";
$ary[100401] = "ホストグループ変数紐付(Ansible-Legacy)";
$ary[100402] = "項番";
$ary[100403] = "ホストグループ変数紐付(Ansible-Legacy)";
$ary[100404] = "ホストグループ変数紐付(Ansible-Legacy)";
$ary[100405] = "オペレーション";
$ary[100406] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[100407] = "Movement";
$ary[100408] = "[元データ]Movement一覧";
$ary[100409] = "ホスト";
$ary[100410] = "[元データ]基本コンソール/機器一覧";
$ary[100411] = "ホストグループ変数名";
$ary[100412] = "ホストグループ変数名をプルダウンより選択";
$ary[100501] = "ホストグループ変数紐付(Ansible-LegacyRole)";
$ary[100502] = "項番";
$ary[100503] = "ホストグループ変数紐付(Ansible-LegacyRole)";
$ary[100504] = "ホストグループ変数紐付(Ansible-LegacyRole)";
$ary[100505] = "オペレーション";
$ary[100506] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[100507] = "Movement";
$ary[100508] = "[元データ]Movement一覧";
$ary[100509] = "ホスト";
$ary[100510] = "[元データ]基本コンソール/機器一覧";
$ary[100511] = "ホストグループ変数名";
$ary[100512] = "ホストグループ変数名をプルダウンより選択";
$ary[100601] = "ホストグループ変数紐付(Ansible-Pioneer)";
$ary[100602] = "項番";
$ary[100603] = "ホストグループ変数紐付(Ansible-Pioneer)";
$ary[100604] = "ホストグループ変数紐付(Ansible-Pioneer)";
$ary[100605] = "オペレーション";
$ary[100606] = "[元データ]基本コンソール/投入オペレーション一覧";
$ary[100607] = "Movement";
$ary[100608] = "[元データ]Movement一覧";
$ary[100609] = "ホスト";
$ary[100610] = "[元データ]基本コンソール/機器一覧";
$ary[100611] = "ホストグループ変数名";
$ary[100612] = "ホストグループ変数名をプルダウンより選択";
$ary[100701] = "ホストグループ分割対象";
$ary[100702] = "項番";
$ary[100703] = "ホストグループ分割対象";
$ary[100704] = "ホストグループ分割対象";
$ary[100705] = "分割対象メニュー";
$ary[100706] = "メニューグループ";
$ary[100707] = "ID";
$ary[100708] = "";
$ary[100709] = "名称";
$ary[100710] = "";
$ary[100711] = "メニュー";
$ary[100712] = "ID";
$ary[100713] = "";
$ary[100714] = "名称";
$ary[100715] = "";
$ary[100716] = "メニューグループ：メニュー";
$ary[100717] = "";
$ary[100718] = "登録対象メニュー";
$ary[100719] = "メニューグループ";
$ary[100720] = "ID";
$ary[100721] = "";
$ary[100722] = "名称";
$ary[100723] = "";
$ary[100724] = "メニュー";
$ary[100725] = "ID";
$ary[100726] = "";
$ary[100727] = "名称";
$ary[100728] = "";
$ary[100729] = "メニューグループ：メニュー";
$ary[100730] = "";
$ary[100731] = "分割済みフラグ";
$ary[100732] = "";
?>