<?php
//   Copyright 2019 NEC Corporation
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
////ja_JP_UTF-8_ITAMATERIAL_ERR
$ary[1001] = "クローンリポジトリ内にファイルが存在するため処理を中止します。";
$ary[1002] = "クローンリポジトリと同一名のファイルが存在するため処理を中止します。";
$ary[1003] = "パスワードに誤りがあります。";
$ary[1004] = "リモートリポジトリURLが不正のためGitのクローンに失敗しました。";
$ary[1005] = "リモートリポジトリには以下の設定が必要です。\ncore.bare=true\ncore.sharedrepository=1\npush.default=simple";
$ary[1006] = "自分のディレクトリは親ディレクトリに選択できません。";
$ary[1007] = "ループ関係になるため選択不可です。";
$ary[1008] = "親ディレクトリの取得に失敗しました。SQLエラー=[{}]";
$ary[1009] = "先頭の「/」は不要です。";
$ary[1010] = "末尾の「/」は不要です。";
$ary[1011] = "「!\"#$%&'|`;:*<>?\」の文字、「.」、「..」は使用できません。";
$ary[1012] = "ディレクトリマスタの検索に失敗しました。SQLエラー=[{}]";
$ary[1013] = "親ディレクトリが更新された可能性があります。親ディレクトリのディレクトリID=[{}]";
$ary[1014] = "ディレクトリ名が重複しているデータがあります。ディレクトリID=[{}]";
$ary[1015] = "「!\"#$%&'|`;:*<>?/\」の文字、「.」、「..」は使用できません。";
$ary[1016] = "ディレクトリが更新された可能性があります。ディレクトリID=[{}]";
$ary[1017] = "ディレクトリマスタの検索に失敗しました。SQLエラー=[{}]";
$ary[1018] = "Ansible-Legacyのテンプレート管理と連携する場合は、先頭「TPF_」かつ半角英数字である必要があります。";
$ary[1019] = "Ansible-Legacyのファイル管理と連携する場合は、先頭「CPF_」かつ半角英数字である必要があります。";
$ary[1020] = "利用できない値です。";
$ary[1021] = "連携先「●」は一箇所のみ選択してください。";
$ary[1022] = "利用できない値です。";
$ary[1023] = "連携先「●」は一箇所のみ選択してください。";
$ary[1024] = "OS種別を選択している場合、対話ファイル素材集は必須です。";
$ary[1025] = "対話ファイル素材集を選択している場合、OS種別は必須です。";
$ary[1026] = "利用できない値です。";
$ary[1027] = "対話ファイル素材集を選択している場合、OS種別は必須です。";
$ary[1028] = "OS種別を選択している場合、対話ファイル素材集は必須です。";
$ary[1029] = "「!\"#$%&'|`;*<>?\」の文字、「.」、「..」は使用できません。";
$ary[1030] = "「!\"#$%&'|`;:*<>?\」の文字、「.」、「..」は使用できません。";
$ary[1031] = "絶対パス（先頭は「/」）で設定してください。";
$ary[1032] = "「/tmp」配下のディレクトリは設定できません。";
$ary[1033] = "末尾の「/」は不要です。";
$ary[1034] = "項番1のデータは更新不可です。";
$ary[1035] = "配下に申請中のデータがあるため更新できません。申請No=[{}]";
$ary[1036] = "申請情報テーブルの検索に失敗しました。SQLエラー=[{}]";
$ary[1037] = "申請中のデータがあるため更新できません。申請No=[{}]";
$ary[5001] = "SQLエラー。エラー内容=[{}]";
$ary[5002] = "資材管理のインターフェース情報が正しく設定されていません。";
$ary[5003] = "資材管理のインターフェース情報のクローンリポジトリ[{}] にGitが設定されていません。";
$ary[5004] = "資材マスタのデータが特定できませんでした。資材マスタを確認してください。申請No=[{}] ";
$ary[5005] = "Gitの操作でエラーが発生しました。エラー内容=[{}]";
$ary[5006] = "ディレクトリの作成に失敗しました。ディレクトリ=[{}]";
$ary[5007] = "外部コマンドの実行に失敗しました。コマンド=[{}]、ステータス=[{}] 、出力結果=[{}] ";
$ary[5008] = "払戻完了のファイル管理データが特定できませんでした。データを確認してください。項番=[{}] ";
$ary[5009] = "ファイルの書き込みに失敗しました。ファイルパス=[{}]";
?>